{
  "module": "4",
  "lesson": "5",
  "step_number": "22",
  "step_title": "Parent-Portal Tour",
  "final_content": "# Parent Portal Tour\n\n## Introduction\n\nWelcome to the Excel High School Parent Portal Tour! This interactive walkthrough will guide you through the essential features of our parent portal, designed to keep you informed and involved in your student's educational journey. The parent portal serves as your window into your student's academic progress, allowing you to communicate with teachers, approve certain activities, and monitor achievements in real-time. By mastering these tools, you'll be equipped to provide timely support and celebrate successes alongside your student. Let's explore the key components that will help you become an active partner in your student's education.\n\n## Accessing the Parent Portal\n\nBefore exploring specific features, let's ensure you can access the portal successfully:\n\n1. Go to the Excel High School website at [www.excelhighschool.com](http://www.excelhighschool.com)\n2. Click the \"Parent Portal\" button in the top right corner\n3. Enter your username (typically your email address) and password\n4. If you've forgotten your password, click \"Forgot Password\" to reset it\n5. For security, the system will automatically log you out after 30 minutes of inactivity\n\n**Pro Tip:** Bookmark the login page for quick access, and consider enabling notifications in your browser to receive alerts about new messages or approval requests.\n\n## Messaging System\n\nThe messaging system is your direct line of communication with teachers and staff at Excel High School. This feature eliminates the need for phone tag or delayed email responses, creating an efficient channel for addressing questions or concerns.\n\nTo access the messaging center:\n1. Click on the \"Messages\" icon in the left navigation panel\n2. You'll see folders for inbox, sent messages, and archived communications\n3. To compose a new message:\n   - Click the \"New Message\" button\n   - Select the recipient from the dropdown menu (includes all your student's teachers and administrative staff)\n   - Enter a subject\n   - Type your message\n   - Click \"Send\"\n\n**Key Features:**\n* Attach files when necessary (doctor's notes, supporting documents)\n* All messages are securely stored in your account history\n* Receive notifications when new messages arrive\n* Filter messages by course, date, or sender\n\n## Approvals Dashboard\n\nThe Approvals section gives you oversight of activities requiring parental consent, streamlining what was once a paper-heavy process.\n\nTo access this feature:\n1. Click on the \"Approvals\" tab in the top navigation bar\n2. Review pending requests categorized by type:\n   - Field trips\n   - Course registrations\n   - Program changes\n   - Extracurricular activities\n\nEach request includes comprehensive details such as dates, locations, costs, educational objectives, and any required preparation. The interface presents clear \"Approve\" or \"Decline\" buttons, along with a space to add comments or ask questions before making your decision.\n\n**Important to Know:**\n* The system maintains a history of all approval activities\n* You'll receive notifications when new approval requests are submitted\n* Some approvals may have deadlines - these will be clearly marked\n* You can set up text message alerts for urgent approval requests\n\n## Progress Monitoring\n\nThe Progress section provides real-time insights into your student's academic journey.\n\nTo access this feature:\n1. Click on the \"Progress\" tab in the main navigation menu\n2. View the comprehensive dashboard with these key components:\n\n**Course Progress Tracker:**\n* Visual progress bars show completion percentages for each course\n* Color-coded indicators: on-track (green), approaching deadline (yellow), or behind schedule (red)\n\n**Grade Overview:**\n* Current grades for all courses\n* Drill-down options to view specific assignments, tests, and participation scores\n* Historical grade trends to track improvement over time\n\n**Attendance Records:**\n* Calendar view highlighting attendance patterns\n* Documentation for absences and tardies\n* Cumulative attendance statistics\n\n**Assignment Calendar:**\n* Upcoming assignments and assessments in calendar format\n* Filter by course, due date, or completion status\n* Export option to add to your personal calendar\n\n**Teacher Notes:**\n* Special comments from instructors about achievements or areas needing support\n* Ability to respond directly to teacher comments\n\n**Customization Options:**\n* Set grade thresholds for alerts\n* Choose notification preferences (email, text, or in-app)\n* Create weekly or monthly progress report emails\n\nBy regularly reviewing this section, you'll be equipped to have meaningful conversations with your student about their educational journey and provide timely support when needed.\n\n## Getting Help\n\nIf you encounter any difficulties while using the Parent Portal:\n\n1. Click the \"Help\" icon in the bottom right corner to access our searchable knowledge base\n2. Use the \"Live Chat\" feature during business hours (8am-8pm EST, Monday-Friday)\n3. Email support@excelhighschool.com for technical assistance\n4. Call our Parent Support Line at 1-800-XXX-XXXX\n\nWe're committed to ensuring you can effectively partner in your student's education through our portal tools.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/SUSquaredV4_versions/EvalatED\\4\\Lesson5_Step22_Parent-Portal Tour.md"
}