{
  "module": "7",
  "lesson": "4",
  "step_number": "5",
  "step_title": "Leadership Reflection Quiz",
  "final_content": "# Leadership Reflection Quiz\n\n## Introduction\nThis quiz will help you assess your leadership qualities and apply them to civic engagement scenarios. Leadership skills are valuable in school, career, and community settings. Complete all sections thoughtfully.\n\n## Self-Assessment\nRate yourself on the following leadership qualities using the scale: \n1 (Strongly Disagree) to 5 (Strongly Agree)\n\n1. I communicate clearly when working with others.\n2. I take initiative when I see problems that need solving.\n3. I listen to others' perspectives before making decisions.\n4. I can motivate others to participate in civic activities.\n5. I take responsibility for my actions and decisions.\n\n## Scenario Questions\n\n**Scenario 1:** Your community needs volunteers for a neighborhood cleanup. Few people have signed up. What leadership approach would be most effective?\nA) Wait for others to take charge\nB) Create and distribute flyers explaining the importance of the project\nC) Personally invite friends and neighbors, explaining how their participation matters\nD) Complain about lack of community involvement\n\n**Scenario 2:** During a group project planning session, team members disagree about priorities. As a leader, what should you do?\nA) Make the decision yourself to save time\nB) Facilitate a discussion to understand all viewpoints before deciding\nC) Go with the majority opinion without discussion\nD) Avoid the conflict by changing the subject\n\n## Reflection\nWrite a 100-150 word reflection addressing the following:\n* One leadership strength you identified in yourself\n* One area where you could improve\n* A specific action you could take to develop your leadership skills for civic engagement\n\n**Scoring:** You must score at least 80% to demonstrate competency in this assessment. You may retake this assessment if needed.\n\n## Next Steps\nAfter completing this assessment, review your instructor's feedback and consider how you might apply these leadership insights to your next group project or community activity.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson4_Step5_Leadership Reflection Quiz.md"
}