{
  "module": "7",
  "lesson": "3",
  "step_number": "3",
  "step_title": "You Do — Scenario Role-Play: Netiquette",
  "final_content": "# You Do — Scenario Role-Play: Netiquette\n\n## Introduction\nIn online learning environments, practicing proper netiquette (internet etiquette) is essential for productive and respectful communication. This activity will help you practice responding appropriately to challenging online situations you may encounter during your time at Excel High School.\n\n## Learning Objectives\nBy completing this activity, you will be able to:\n- Identify inappropriate online communication behaviors\n- Craft respectful responses to challenging situations\n- Apply specific netiquette principles in your online interactions\n\n## Activity Instructions\nBelow are three forum posts representing different challenging online communication scenarios. For each scenario:\n1. Read the post carefully\n2. Draft a 100-word respectful response\n3. Identify which netiquette principle you applied in your response\n4. Explain briefly why your approach would be effective\n\n## Scenario 1: Heated Debate\n**Forum Post:** \"This assignment is COMPLETELY POINTLESS! Anyone who thinks this helps us learn is DELUSIONAL. I can't believe we're wasting our time on this garbage when we could be learning something useful. If you disagree with me, you're part of the problem!\"\n\n## Scenario 2: Misinformation\n**Forum Post:** \"I read online that you don't need to cite sources in academic writing anymore. My cousin's friend is in college and says nobody checks citations anyway. So I'm not going to bother with references for this project since it's all just busy work.\"\n\n## Scenario 3: Trolling\n**Forum Post:** \"lol why is everyone trying so hard in this class? none of this matters in real life. just copy answers from google like i do. teachers don't even read our work anyway 😂😂😂\"\n\n## Submission Requirements\nFor each scenario, submit:\n1. Your 100-word respectful response\n2. A statement identifying which netiquette principle you applied (e.g., respectful tone, factual correction, maintaining professionalism)\n3. A brief explanation (2-3 sentences) of why you chose this approach\n\n## Helpful Tips\n- Remember that tone can be difficult to interpret in text - avoid sarcasm\n- Consider how you would feel receiving your response\n- Focus on addressing the issue rather than criticizing the person\n- Use specific examples from the Excel Student Orientation materials on proper online communication\n\nRemember to remain constructive and respectful in all your responses, even when addressing inappropriate communication.\n\n## Grading Criteria\nYour submission will be evaluated on:\n- Appropriateness of your response to each scenario\n- Correct identification of netiquette principles\n- Quality of your explanation\n- Overall professionalism and clarity",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson3_Step3_You Do _ Scenario Role-Play_ Netiquette.md"
}