{
  "module": "7",
  "lesson": "4",
  "step_number": "1",
  "step_title": "I Do — Leading for Impact",
  "final_content": "# I Do — Leading for Impact: Video Script\n\n## Introduction (0:00-0:30)\n\n**[Visual: Diverse group of teenagers working together on community projects]**\n\nWelcome to \"Leading for Impact,\" where we explore how you can make meaningful change in your community! Today, we're focusing on servant leadership—a powerful approach where leaders prioritize the needs of others above their own.\n\nServant leadership isn't about being in charge; it's about empowering others and creating positive change. As Robert K. Greenleaf, who developed this concept, said: \"The servant-leader is servant first... It begins with the natural feeling that one wants to serve.\"\n\n## Servant Leadership Traits (0:30-1:15)\n\n**[Visual: Graphics highlighting each trait as it's mentioned]**\n\nWhat makes a servant leader? Let's explore key traits:\n\n1. **Listening** - Servant leaders listen deeply to understand others' perspectives and needs\n2. **Empathy** - They put themselves in others' shoes to better support them\n3. **Awareness** - They stay conscious of how their actions impact the community\n4. **Commitment to growth** - They help everyone around them develop and thrive\n5. **Building community** - They bring people together around shared goals\n\n**Real-World Example:** Consider Malala Yousafzai, who demonstrates these traits by amplifying the voices of girls seeking education worldwide. She listens to their struggles, empathizes with their challenges, and builds a global community of advocates.\n\n## Youth-Led Examples (1:15-2:15)\n\n**[Visual: Images of youth leaders and their initiatives]**\n\nYoung people across the world are embodying servant leadership:\n\n**Greta Thunberg** started as a single student protesting climate inaction. Rather than positioning herself as the center of attention, she uses her platform to amplify scientific voices and encourage youth worldwide to take action in their communities.\n\n**Jack Andraka** developed a breakthrough pancreatic cancer test as a teenager. Instead of keeping his research private, he openly shares his methods and encourages other young scientists to solve problems.\n\n**Local example:** Students at Carson High School noticed food insecurity in their community and created a student-run food pantry. Instead of managing everything themselves, they built a system where different student groups take responsibility, creating sustainability beyond any single leader.\n\n## Civic Impact Connections (2:15-3:00)\n\n**[Visual: Community transformation scenes showing before/after impacts]**\n\nWhen you apply servant leadership to civic action, remarkable things happen:\n\n1. **Sustainability**: Projects last beyond any single leader\n2. **Deeper impact**: By listening to community needs, solutions address real problems\n3. **Ripple effects**: As you empower others, they develop leadership skills too\n4. **Trust building**: Communities develop greater trust in youth-led initiatives\n\n**Key Takeaway:** The most effective civic leaders don't just solve problems—they build capacity in others to create ongoing positive change.\n\n## Application & Reflection (3:00-3:30)\n\n**[Visual: Step-by-step process for applying servant leadership]**\n\nHow can you apply servant leadership in your own community?\n\n1. **Identify needs**: What issues matter to people around you?\n2. **Listen first**: Talk with those affected before proposing solutions\n3. **Build a team**: Who else cares about this issue? How can you involve them?\n4. **Share leadership**: Distribute responsibilities based on strengths\n5. **Measure impact**: How will you know if your efforts are making a difference?\n\n**[Closing visual: Call to action screen with reflection questions]**\n\nAs you consider your own leadership journey, ask yourself:\n- What community need could you address through servant leadership? \n- Who might you empower along the way?\n- What first step could you take this week?\n\n**Remember:** Your Success Coach is available to discuss your ideas and help you connect with resources for your community project!",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson4_Step1_I Do _ Leading for Impact.md"
}