{
  "module": "7",
  "lesson": "6",
  "step_number": "4",
  "step_title": "Curate & Publish Portfolio (Spiral 1)",
  "final_content": "# Curate & Publish Portfolio (Spiral 1)\n\n## Introduction\nWelcome to the first stage of creating your Citizenship Portfolio! This portfolio represents your journey as an engaged citizen and showcases your understanding of civic responsibility. In this spiral, you'll gather key artifacts that demonstrate your learning and growth, write an introduction to your portfolio, and share your work with peers.\n\n## Learning Objectives\nBy completing this portfolio assignment, you will:\n* Organize evidence of your civic engagement learning\n* Articulate your personal connection to citizenship\n* Demonstrate understanding of civic concepts through reflection\n* Share your civic interests with a learning community\n\n## Portfolio Artifact Checklist\n\nBefore publishing your portfolio, ensure you have gathered all of the following artifacts:\n\n1. **Action Plan**: Your detailed strategy for addressing a community issue, including goals, timeline, and resources needed.\n\n2. **Civic Digest**: A summary of current events and civic issues you've researched that relate to your chosen focus area.\n\n3. **Citizenship Pledge**: Your personal commitment statement outlining how you will contribute positively to your community.\n\n4. **Civic Toolkit**: A collection of resources, contacts, and tools you've assembled to support civic engagement.\n\n5. **Reflection**: Your thoughtful analysis of what you've learned about citizenship and civic responsibility throughout this process.\n\n## Writing Your 200-Word Introduction\n\nYour portfolio introduction should accomplish the following:\n* Explain the purpose of your citizenship portfolio\n* Briefly describe your civic interests and chosen focus areas\n* Mention what viewers will find in your collection of artifacts\n* Share a personal statement about why civic engagement matters to you\n\n**Example Introduction Format:**\n```\nMy Citizenship Portfolio represents [describe purpose]. Through this collection, I explore [civic interests]. The artifacts included demonstrate [what they show about your learning]. I've focused particularly on [your focus area] because [personal connection]. As you review my work, you'll see evidence of my growth in understanding [specific civic concepts]. This portfolio matters because [personal statement about citizenship].\n```\n\n**Pro Tip:** Write your introduction in a word processor first so you can check your word count and edit before publishing.\n\n## Publishing Instructions\n\n1. Organize your artifacts in a digital format (Google Sites, WordPress, etc.)\n   * Need help choosing a platform? Check the \"Digital Portfolio Resources\" in the course materials\n\n2. Include your 200-word introduction on the main page\n\n3. Create separate sections for each artifact with brief descriptions\n   * Make navigation intuitive with clear headings and consistent formatting\n\n4. Copy the link to your published portfolio\n\n5. Share the link in our class forum under \"Citizenship Portfolios - Spiral 1\"\n\n6. Include a one-sentence description of your focus area with your link\n\n**Time Management Tip:** This assignment typically takes 2-3 hours to complete. Consider breaking it into smaller sessions if you're balancing other responsibilities.\n\n## Assessment Criteria\n\nYour portfolio will be evaluated on:\n* Completeness (all required artifacts included)\n* Quality of introduction\n* Organization and presentation\n* Evidence of civic understanding\n* Thoughtfulness of reflection\n\n## Support Resources\n* Need technical help? Visit the Excel High School Tutoring Center\n* Writing assistance available through the Writing Lab\n* Questions about the assignment? Use the BRYTE AI Tutor or message your instructor\n\n## Next Steps\n\nAfter publishing, you'll receive peer feedback to help strengthen your portfolio for Spiral 2, where we'll deepen your civic engagement project. Be sure to review at least two classmates' portfolios and provide constructive feedback.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson6_Step4_Curate _ Publish Portfolio _Spiral 1_.md"
}