{
  "module": "9",
  "lesson": "6",
  "step_number": "2",
  "step_title": "Habit Tracker Setup",
  "final_content": "# Habit Tracker Setup in Notion\n\n## Introduction\nBuilding consistent habits is a cornerstone of effective time management and academic success. In this lesson, you'll learn how to create a customized habit tracker in Notion that will help you monitor your daily routines, visualize your progress, and stay accountable to your goals—whether you're balancing coursework, work responsibilities, or personal commitments.\n\n## Learning Objectives\nBy the end of this lesson, you will be able to:\n- Create a personalized habit tracking system in Notion\n- Set up properties and formulas to monitor your progress\n- Implement a mobile-friendly tracking solution\n- Develop strategies for maintaining consistent habits\n\n## Setting Up Your Habit Tracker\n\n### Step 1: Create a New Database\n1. Open Notion and click the \"+ New Page\" button in the sidebar\n2. Select \"Table - Database\" from the options\n3. Name your database \"Habit Tracker\" at the top of the page\n\n![Example of Notion's New Page menu with Table Database highlighted](https://placeholder-image.com/notion-new-database.jpg)\n\n### Step 2: Set Up Properties\nLet's customize your database with the right properties to track your habits effectively:\n\n1. Create a \"Habit\" property (this is your default Title column)\n2. Add a \"Category\" property (Select type) with options like:\n   - Academic (for study sessions, assignment completion)\n   - Health (for exercise, sleep, nutrition)\n   - Productivity (for time management, organization)\n   - Personal Development (for reading, skills practice)\n3. Add a \"Frequency\" property (Select type) with options:\n   - Daily\n   - Weekly\n   - Monthly\n4. Add a \"Completion\" property (Formula type) - we'll set this up later\n5. Add a \"Days Completed\" property (Number type)\n6. Add a \"Target Days\" property (Number type)\n\n**Pro Tip:** Consider what habits would most support your academic success at Excel High School. For example, tracking daily study time, assignment completion, or reading progress.\n\n### Step 3: Set Up Formulas\nFor the \"Completion\" property, enter this formula:\n```\nround(prop(\"Days Completed\") / prop(\"Target Days\") * 100) + \"%\"\n```\n\nThis will calculate your completion percentage automatically.\n\n### Step 4: Create a Progress Bar\n1. Add a \"Progress\" property (Formula type)\n2. Enter this formula:\n```\nslice(\"■■■■■■■■■■\", 0, floor(prop(\"Days Completed\") / prop(\"Target Days\") * 10)) + slice(\"□□□□□□□□□□\", 0, 10 - floor(prop(\"Days Completed\") / prop(\"Target Days\") * 10))\n```\n3. This creates a visual progress bar using filled and empty squares\n\n**Troubleshooting Tip:** If you encounter errors with the formula, double-check that you've copied it exactly as shown, including all quotation marks and parentheses.\n\n### Step 5: Add Your Habits\nBegin adding habits to your tracker:\n1. Click \"+ New\" to add a habit\n2. Name it (e.g., \"Complete one Excel High School assignment\")\n3. Select a category\n4. Set frequency\n5. Enter target days (e.g., 30 for a monthly goal)\n6. Start with 0 for days completed\n\n**Example Habits for Excel High School Students:**\n- Complete one course module\n- Study for 45 minutes without distractions\n- Review feedback on previous assignments\n- Prepare questions for my Success Coach\n- Check announcements and updates in my Student Portal\n\n## Syncing to Mobile\n\n1. Download the Notion app on your mobile device\n2. Log in with the same account credentials\n3. Navigate to your workspace\n4. Find and bookmark your Habit Tracker for easy access\n5. Enable notifications in Notion settings for daily reminders\n\n## Daily Usage Tips\n\n1. Update your tracker daily by increasing the \"Days Completed\" number\n2. Watch your progress bar fill up as you maintain consistency\n3. Review weekly to identify patterns and areas for improvement\n4. Adjust target days as needed based on your progress\n5. Celebrate small wins to build motivation\n\n## Reflection Activity\n\nTake a moment to consider:\n1. What three habits would most improve your academic performance?\n2. What time of day would be best for you to update your habit tracker?\n3. How might you reward yourself for maintaining consistency?\n\n## Conclusion\n\nYour Notion habit tracker serves as both a checkpoint system and a visual nudge to maintain progress on your goals. By documenting your habits and seeing your progress, you're applying effective self-direction techniques that support your time management skills—a critical component for success in Excel High School's asynchronous learning environment.\n\n**Next Steps:** After setting up your habit tracker, consider sharing your academic goals with your Success Coach for additional accountability and support.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/9 Time Management\\9\\Lesson6_Step2_Habit Tracker Setup.md"
}