{
  "module": "9",
  "lesson": "2",
  "step_number": "5",
  "step_title": "Stack Demo",
  "final_content": "# Stack Demo: Dashboard Tour\n\n## Learning Objectives\nBy the end of this activity, you will be able to:\n- Navigate the Stack application dashboard effectively\n- Create and organize tasks using Stack's key features\n- Utilize Stack's time management tools to improve your productivity\n\n## Screencast Instructions\nFor this assignment, you'll need to record a **two-minute screencast** touring the Stack application dashboard. This activity will help you demonstrate your understanding of digital productivity tools while practicing presentation skills.\n\nYour screencast should include:\n\n- A brief introduction of yourself and the purpose of your demonstration\n- Navigation through the main interface (showing how to access different sections)\n- Demonstration of how to create and organize tasks\n- Explanation of the calendar integration features\n- Overview of notification settings\n- Detailed explanation of one time-management feature that you find most useful\n\n**Accessibility Tip:** Include verbal descriptions of what you're clicking on to make your screencast more accessible.\n\n## Recording Options\nYou may use any screen recording tool you're comfortable with:\n- Loom (free version available)\n- Screencastify (Chrome extension)\n- QuickTime (Mac users)\n- Xbox Game Bar (Windows users)\n- Or any other tool that allows screen recording with audio\n\nNeed help? Visit the Excel Student Technology Support page or contact your Success Coach.\n\n## Submission Guidelines\n1. Record your 2-minute screencast\n2. Review your video to ensure audio clarity and content completeness\n3. Upload your video to the submission area\n4. Complete the self-assessment questions below\n\n## Self-Assessment Questions\nAfter watching your own screencast, complete these multiple-choice questions to reinforce your learning:\n\n1. Which Stack feature allows for setting recurring tasks?\n2. How does Stack integrate with external calendar applications?\n3. What productivity analytics does Stack provide?\n4. Which collaboration features are available in Stack?\n5. How does Stack's priority system work?\n\nYour answers will be auto-graded upon submission, providing immediate feedback on your understanding.\n\n## Time Management Tip\nPlan to spend about 30 minutes on this assignment: 10 minutes exploring Stack, 5 minutes planning your screencast, 5 minutes recording (including retakes), and 10 minutes completing the self-assessment.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/9 Time Management\\9\\Lesson2_Step5_Stack Demo.md"
}