{
  "module": "7",
  "lesson": "4",
  "step_number": "2",
  "step_title": "We Do — Mini-Campaign Planner",
  "final_content": "# We Do — Mini-Campaign Planner\n\n## Introduction\n\nIn today's lesson, we'll explore how to plan and organize a civic action campaign using a Mini-Campaign Planner. This practical tool helps you structure your ideas and create an effective roadmap for community initiatives. We'll use an anti-litter campaign as our example to demonstrate how the planner works.\n\n## Learning Objectives\nBy the end of this lesson, you will be able to:\n- Identify the five key elements of an effective civic campaign\n- Apply the SMART framework to create meaningful campaign goals\n- Develop a strategic plan for a community issue you care about\n\n## The Mini-Campaign Planner\n\nA campaign planner helps you organize your thoughts and create a strategic approach to addressing community issues. Our interactive PDF planner focuses on five key elements:\n\n1. **Campaign Goal**: What you want to achieve\n2. **Target Audience**: Who you need to reach\n3. **Communication Channels**: How you'll reach them\n4. **Timeline**: When activities will happen\n5. **Success Metrics**: How you'll measure results\n\n## Example: Anti-Litter Campaign\n\nLet's walk through each section of the planner using an anti-litter campaign example:\n\n### 1. Campaign Goal\n**Example Goal**: Reduce litter in Community Park by 50% within three months.\n\nYour goal should be specific, measurable, achievable, relevant, and time-bound (SMART). Rather than saying \"clean up the park,\" we've specified how much improvement we want to see and by when.\n\n**Quick Check**: What makes this goal \"SMART\"? Identify each component.\n- S: _____\n- M: _____\n- A: _____\n- R: _____\n- T: _____\n\n### 2. Target Audience\n**Example Audiences**:\n- Park visitors (primary)\n- Local students\n- Nearby businesses\n- Neighborhood residents\n\nIdentifying your audience helps you tailor your message effectively. For our anti-litter campaign, we're focusing primarily on park users but including other stakeholders who can help create change.\n\n**Reflection Point**: Why might it be important to identify both primary and secondary audiences?\n\n### 3. Communication Channels\n**Example Channels**:\n- Social media (Instagram, Facebook)\n- School announcements\n- Community bulletin boards\n- Local newspaper\n- Face-to-face outreach at the park\n\nChoose channels based on where your audience is most likely to engage. Our campaign uses both online and offline methods to maximize reach.\n\n**Pro Tip**: Different audiences may respond better to different channels. Consider creating a simple chart matching your audiences to their preferred communication methods.\n\n### 4. Timeline\n**Example Timeline**:\n- Week 1-2: Research current litter patterns and recruit volunteers\n- Week 3-4: Launch social media campaign and install new trash bins\n- Week 5-8: Host weekend cleanup events\n- Week 9-12: Conduct follow-up assessment and share results\n\nBreaking your campaign into phases helps keep activities organized and ensures steady progress.\n\n**Time Management Strategy**: Set calendar reminders for key milestones to stay on track with your timeline.\n\n### 5. Success Metrics\n**Example Metrics**:\n- Number of volunteers engaged\n- Pounds of litter collected\n- Before/after photos of park areas\n- Reduction in visible litter (measured weekly)\n- Social media engagement statistics\n\nMeasuring success helps you evaluate your impact and make improvements for future initiatives.\n\n**Critical Thinking Question**: Why is it important to have multiple ways to measure success?\n\n## Activity: Complete Your Own Mini-Campaign Planner\n\nNow it's your turn! Think about a community issue you care about and use the Mini-Campaign Planner to outline your approach. \n\n**Step 1**: Download the Mini-Campaign Planner PDF from the Resources section.\n**Step 2**: Choose a community issue that matters to you.\n**Step 3**: Complete each section of the planner, referring back to our example as needed.\n**Step 4**: Save your completed planner to submit with your assignment.\n\n**Remember these key tips:**\n- Make your goals specific and measurable (SMART)\n- Consider both online and offline engagement strategies\n- Think about how you'll know if your campaign is successful\n- Be realistic about your timeline and resources\n\nBy using this planner, you're applying leadership skills to organize civic action and creating meaningful community presence both online and offline.\n\n## Additional Resources\n- [Link] Sample Completed Campaign Planners\n- [Link] SMART Goals Worksheet\n- [Link] Community Engagement Strategies Guide",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson4_Step2_We Do _ Mini-Campaign Planner.md"
}