{
  "module": "7",
  "lesson": "2",
  "step_number": "3",
  "step_title": "You Do — Editorial Analysis",
  "final_content": "# You Do — Editorial Analysis Quiz\n\n## Interactive Fallacy and Evidence Quality Assessment\n\nTest your critical thinking skills with this 10-question quiz. For each example, identify the logical fallacy present and rate the quality of evidence.\n\n### Learning Objectives\n* Identify common logical fallacies in media and political statements\n* Evaluate the quality of evidence in argumentative claims\n* Apply critical thinking skills to real-world examples\n\n### Instructions\nFor each statement below:\n1. Select the logical fallacy present (or \"No fallacy\" if appropriate)\n2. Rate the evidence quality (Very poor, Poor, Weak, Moderate, Strong)\n3. Submit your answers to receive immediate feedback\n\n### Question 1\n**Statement:** \"Senator Johnson must be corrupt because all politicians are corrupt.\"\n- **Identify the fallacy:** Hasty generalization\n- **Rate evidence quality:** Poor\n> **Feedback:** Correct! This is a hasty generalization that assumes all members of a group share the same characteristic without sufficient evidence.\n\n### Question 2\n**Statement:** \"If we allow same-day voter registration, next thing you know, people will be voting multiple times and elections will be meaningless.\"\n- **Identify the fallacy:** Slippery slope\n- **Rate evidence quality:** Poor\n> **Feedback:** Excellent! This is a slippery slope fallacy that assumes one action will inevitably lead to extreme consequences without evidence.\n\n### Question 3\n**Statement:** \"According to a peer-reviewed study published in the Journal of Political Science, districts with mail-in voting showed no statistically significant increase in fraud cases over a 20-year period.\"\n- **Identify the fallacy:** No fallacy present\n- **Rate evidence quality:** Strong\n> **Feedback:** Correct! This statement cites specific research from a credible source with a substantial time frame.\n\n### Question 4\n**Statement:** \"My opponent wants to increase education funding, but can we trust someone who got a C in economics during college?\"\n- **Identify the fallacy:** Ad hominem\n- **Rate evidence quality:** Poor\n> **Feedback:** Right! This attacks the person rather than addressing their argument.\n\n### Question 5\n**Statement:** \"The mayor claims the new highway will reduce traffic, but she's just saying that because construction companies donated to her campaign.\"\n- **Identify the fallacy:** Genetic fallacy\n- **Rate evidence quality:** Poor\n> **Feedback:** Correct! This dismisses an argument based on its origin rather than its merits.\n\n### Question 6\n**Statement:** \"Either we cut taxes dramatically or the economy will collapse.\"\n- **Identify the fallacy:** False dilemma\n- **Rate evidence quality:** Poor\n> **Feedback:** Excellent! This presents only two extreme options when many alternatives exist.\n\n### Question 7\n**Statement:** \"A recent survey of 50 people at the mall showed that 80% oppose the new zoning law.\"\n- **Identify the fallacy:** No clear fallacy, but sampling bias\n- **Rate evidence quality:** Weak\n> **Feedback:** Correct! While not technically a fallacy, this uses a small, non-representative sample to draw broad conclusions.\n\n### Question 8\n**Statement:** \"The city council's proposal must be good because it was approved unanimously.\"\n- **Identify the fallacy:** Appeal to popularity\n- **Rate evidence quality:** Poor\n> **Feedback:** Right! This assumes something is correct simply because many people support it.\n\n### Question 9\n**Statement:** \"Climate legislation is unnecessary because it was cold last winter.\"\n- **Identify the fallacy:** Anecdotal evidence\n- **Rate evidence quality:** Very poor\n> **Feedback:** Correct! This uses a single personal observation to contradict systematic scientific evidence.\n\n### Question 10\n**Statement:** \"According to three independent economic analyses, the infrastructure bill would create approximately 2 million jobs over five years, though estimates vary by ±15%.\"\n- **Identify the fallacy:** No fallacy present\n- **Rate evidence quality:** Strong\n> **Feedback:** Excellent! This presents specific data from multiple sources while acknowledging limitations.\n\n### Reflection (Required)\nTake a moment to reflect on what you've learned:\n* Which fallacies do you find most common in news media today?\n* How can identifying these fallacies help you become a more informed citizen?\n* What strategies will you use to evaluate evidence quality in the future?\n\nType your response in the box below (minimum 3-4 sentences).",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson2_Step3_You Do _ Editorial Analysis.md"
}