{
  "module": "7",
  "lesson": "3",
  "step_number": "5",
  "step_title": "Digital Footprint Self-Audit",
  "final_content": "# Digital Footprint Self-Audit\n\n## Introduction\nYour digital footprint is the trail of data you leave behind when using the internet. Taking control of your online presence is essential for protecting your privacy, security, and future opportunities.\n\n## Learning Objectives\nBy completing this assignment, you will:\n- Understand the components of your digital footprint\n- Implement practical security measures to protect your online identity\n- Develop habits for ongoing digital safety management\n\n## Assignment: Digital Safety Self-Audit\n\n### Instructions:\n1. Review the checklist of ten digital safety behaviors below\n2. Implement at least 5 of these safety measures on your devices/accounts\n3. Take screenshots showing your updated privacy/security settings (be sure not to include personal information)\n4. Complete the reflection questions about what you learned\n5. Upload your screenshots and reflection to complete this assignment\n\n### Digital Safety Checklist:\n1. **Password strength and uniqueness**: Create strong, unique passwords for important accounts using a combination of letters, numbers, and symbols. Consider using a password manager.\n2. **Two-factor authentication**: Enable 2FA on your primary accounts (email, social media, banking).\n3. **Social media privacy**: Review and adjust who can see your posts, photos, and personal information.\n4. **Location services**: Audit which apps have access to your location and limit to only essential services.\n5. **Browser privacy**: Optimize settings to control cookies, tracking, and browsing history.\n6. **Search history management**: Clear unnecessary search history and adjust settings for future searches.\n7. **App permissions**: Review which apps have access to your camera, microphone, contacts, etc.\n8. **Email security**: Unsubscribe from unwanted emails and check spam filter settings.\n9. **Cloud storage security**: Review what personal files are stored in the cloud and check sharing settings.\n10. **Personal information audit**: Search your name online and check what information is publicly visible.\n\n### Reflection Questions:\n1. Which safety measures did you implement and why did you choose those?\n2. What surprised you most about your digital footprint?\n3. What ongoing habits will you develop to maintain your digital safety?\n\n### Submission Requirements:\n- Screenshots showing at least 5 implemented safety measures\n- Completed reflection questions (250-300 words total)\n\nThis assignment will be automatically marked as complete when you upload both your screenshots and reflection.\n\n### Resources:\n- [Common Sense Media: Digital Footprint Guide](https://www.commonsense.org/education/digital-citizenship/lesson/digital-footprints-stay-safe-online)\n- [BRYTE AI Tutor](https://excelhighschool.com/bryte-ai-tutor/) is available to help with any questions about this assignment",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson3_Step5_Digital Footprint Self-Audit.md"
}