{
  "module": "7",
  "lesson": "6",
  "step_number": "5",
  "step_title": "Portfolio Submission Gate",
  "final_content": "# Portfolio Submission Gate\n\n## Evaluation Criteria\n\nYour Citizenship Portfolio will be assessed according to the following rubric:\n\n1. **Completeness (25%)** - All required components are included and thoroughly addressed\n2. **Quality (25%)** - Work demonstrates care, effort, and attention to detail\n3. **Reflection Depth (25%)** - Personal insights show critical thinking about civic engagement\n4. **Design (25%)** - Portfolio is well-organized, visually appealing, and professionally presented\n\n## Submission Requirements\n\nBefore submitting your portfolio, please ensure:\n- You've included all components listed in the project guidelines\n- Your work is free from spelling and grammatical errors\n- All citations follow proper formatting (MLA or APA)\n- Files are in the requested format (.pdf or .pptx)\n\n## Achievement Recognition\n\nUpon submission, your portfolio will be evaluated by your instructor. If you achieve a score of 85% or higher, you will receive:\n\n- A digital Citizenship Badge that can be added to your Excel High School credential portfolio\n- Recognition of your civic learning accomplishments\n- Validation of your community impact\n\nThis badge represents your commitment to active citizenship and can be included in college applications, resumes, or professional portfolios.\n\n## Need Help?\n\nIf you have questions about your portfolio:\n- Contact your instructor through the messaging system\n- Visit the Writing Lab for feedback on written components\n- Schedule time with your Success Coach for additional guidance\n\nRemember: You can submit your portfolio for preliminary feedback before final submission!",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/7 Citizenship\\7\\Lesson6_Step5_Portfolio Submission Gate.md"
}