{
  "module": "8",
  "lesson": "4",
  "step_number": "19",
  "step_title": "Evidence-Based Decision Scenario",
  "final_content": "# Evidence-Based Decision Scenario: Student Pathway Planning\n\n## Overview\nIn this 15-minute activity, you'll apply evidence-based decision making to create personalized academic pathways for two different students. This exercise will help you develop skills in educational planning that you can apply to your own academic journey at Excel High School.\n\n## Instructions\nYou will:\n1. Review two student profiles with different backgrounds, strengths, and goals\n2. Create appropriate course plans using the drag-and-drop interface\n3. Write a brief justification for your recommendations\n\n## Student Profiles\n\n**Profile 1: Maya**\n* Junior with 3.8 GPA\n* Strong in mathematics and science\n* Interested in engineering\n* Participates in robotics club\n* Wants to attend a competitive university\n\n**Profile 2: Jackson**\n* Junior with 2.9 GPA\n* Excels in creative writing and communications\n* Interested in journalism\n* Works part-time 20 hours weekly\n* Plans to attend community college, then transfer\n\n## Course Planning Activity\n[Drag-and-drop interface with course options including AP/Honors courses, standard courses, electives, and support resources]\n\n*Tip: Consider both academic rigor and balance when creating each plan. Remember that the best plan matches the student's goals while setting them up for success.*\n\n## Justification\nAfter creating each course plan, write a 75-100 word justification explaining:\n* How your recommendations align with the student's academic strengths\n* How your plan supports their future goals\n* How you've accounted for their personal circumstances\n* Why your selections create an appropriate balance of challenge and support\n\n## Reflection Questions\n* What specific evidence from the student profiles most strongly influenced your decisions?\n* How did you balance academic challenge with student well-being?\n* How might your approach to planning differ if you were creating your own academic pathway?\n* What additional information would have been helpful to make even better recommendations?\n\n## Application\nConsider how this evidence-based approach to academic planning could help with your own educational journey at Excel High School.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/8 College\\8\\Lesson4_Step19_Evidence-Based Decision Scenario.md"
}