{
  "module": "8",
  "lesson": "3",
  "step_number": "13",
  "step_title": "Sample Four-Year Plan Build",
  "final_content": "# Sample Four-Year Plan Build\n\n## Introduction\n\nPlanning your high school journey requires thoughtful organization to ensure you meet graduation requirements while balancing your workload and exploring your interests. This tutorial will guide you through creating a comprehensive four-year plan using Google Sheets that will help you visualize your academic path at Excel High School.\n\n## Learning Objectives\nBy the end of this tutorial, you will be able to:\n- Create a color-coded semester plan in Google Sheets\n- Track prerequisites to ensure proper course sequencing\n- Balance your course workload across semesters\n- Design a personalized course plan that supports your goals and interests\n\n## Step-by-Step Tutorial\n\n### 1. Setting Up Your Google Sheet\n\n1. Open Google Sheets and create a new spreadsheet\n2. Title your spreadsheet \"My Excel High School Four-Year Plan\"\n3. Create the following column headers:\n   - Course Name\n   - Credits\n   - Prerequisites\n   - Grade 9 (Fall/Spring)\n   - Grade 10 (Fall/Spring)\n   - Grade 11 (Fall/Spring)\n   - Grade 12 (Fall/Spring)\n\n### 2. Color-Coding Your Semesters\n\n1. Select all semester columns (Grade 9-12, Fall/Spring)\n2. Apply alternating colors to distinguish semesters:\n   - Fall semesters: Light blue (#D0E2F3)\n   - Spring semesters: Light green (#D8E4BC)\n   \n**Tip:** Color-coding makes it easier to visualize your course distribution across the academic year.\n\n### 3. Setting Up Prerequisite Tracking\n\n1. In the \"Prerequisites\" column, list any courses that must be completed before taking each course\n2. Use a simple checkmark system in your plan:\n   - Only place courses in semesters after their prerequisites\n   - Review your plan to ensure proper sequencing\n\n**Note for Adult Learners:** If you're completing your diploma on an accelerated timeline, you can adapt this plan to fit your schedule while still maintaining proper course sequencing.\n\n### 4. Balancing Your Workload\n\n1. Create a row at the bottom of each semester column labeled \"Total Credits\"\n2. Use the SUM function to calculate credits per semester\n3. Aim for a balanced workload:\n   - Standard pace: 6-7 credits per semester\n   - Accelerated pace: Consider your personal commitments and available study time\n   - Credit recovery: Focus on required courses first, then add electives\n\n### 5. Personalizing Your Plan\n\n1. Add a \"Notes\" column to track your thoughts about each course\n2. Create a \"Graduation Requirements\" checklist on a separate tab\n3. Include courses that align with your post-graduation goals:\n   - College-bound: Consider AP/Honors courses\n   - Career-focused: Include relevant electives\n   - Special interests: Add courses in areas you're passionate about\n\n## Practice Activity\n\nNow it's your turn to build your four-year plan:\n\n1. List all required Excel High School courses for graduation\n2. Add electives that align with your interests and goals\n3. Distribute courses across semesters, ensuring prerequisites are completed first\n4. Balance your workload based on your personal circumstances and learning pace\n5. Review and adjust your plan with your Success Coach or parent/guardian\n\nRemember, this plan is flexible and can be adjusted as your interests evolve throughout your time at Excel High School.\n\n## Conclusion\n\nYour four-year plan is a powerful tool for visualizing your high school journey. By using color-coding, prerequisite tracking, and workload balancing, you've created a roadmap that will help you achieve your academic goals while maintaining a healthy school-life balance. Your Success Coach is available to help you refine this plan and make adjustments as needed.\n\n**Next Steps:** Share your completed plan with your Success Coach for personalized feedback and guidance.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/8 College\\8\\Lesson3_Step13_Sample Four-Year Plan Build.md"
}