{
  "module": "8",
  "lesson": "2",
  "step_number": "9",
  "step_title": "Compare-and-Contrast Table",
  "final_content": "# Career Path Comparison Worksheet\n\n## Instructions\nThis interactive worksheet will help you analyze and compare two potential career paths or college majors you're considering. For each path, you'll evaluate the pros, cons, and overall fit with your personal goals and interests.\n\n1. Select two career paths or college majors you're interested in exploring\n2. Complete the table below, ranking each aspect on a scale of 1-5 (5 being highest)\n3. Add specific notes to explain your rankings\n4. Your responses will automatically save in our learning management system\n\n## Before You Begin\nTake a moment to review the career resources in the Excel High School Student Portal or consult with your Success Coach if you need help identifying potential career paths that match your interests and strengths.\n\n## Comparison Table\n\n| Criteria | Career/Major Option 1: ____________ | Career/Major Option 2: ____________ |\n|----------|-----------------------------------|-----------------------------------|\n| Salary Potential (1-5)<br>*Consider starting and mid-career salaries* |  |  |\n| Job Growth Outlook (1-5)<br>*Research projected demand over next 10 years* |  |  |\n| Work-Life Balance (1-5)<br>*Consider typical hours, flexibility, stress levels* |  |  |\n| Required Education (1-5)<br>*Higher score = better match with your education plans* |  |  |\n| Personal Interest Level (1-5)<br>*How excited are you about the daily work?* |  |  |\n| Alignment with Skills (1-5)<br>*How well do your strengths match requirements?* |  |  |\n| Overall Fit (1-5) |  |  |\n| Key Pros<br>*List at least 3 specific advantages* |  |  |\n| Key Cons<br>*List at least 3 potential challenges* |  |  |\n\n## Reflection Questions\n1. Which option appears to be a better fit based on your analysis? Explain your reasoning with specific examples from your comparison.\n\n2. What additional information might you need before making a final decision? List at least 2-3 specific questions you still have.\n\n3. What steps could you take in the next 6-12 months to explore or prepare for your preferred option? Be specific.\n\n## Resources\n* Bureau of Labor Statistics (www.bls.gov/ooh) - Research careers, salaries, and job outlook\n* O*NET OnLine (www.onetonline.org) - Detailed information about skills and work environments\n* Excel High School Career Center - Access through your Student Portal for personalized guidance\n\nRemember: Your Success Coach is available to discuss your career exploration results and help you develop an action plan.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/8 College\\8\\Lesson2_Step9_Compare-and-Contrast Table.md"
}