{
  "module": "6",
  "lesson": "15",
  "step_number": "1",
  "step_title": "Evidence Checklist",
  "final_content": "# Evidence Evaluation Checklist\n\n## Purpose\nThis checklist helps you evaluate the quality of evidence used in your writing. You must score at least 80% on this assessment before proceeding to the next unit.\n\n## Instructions\nReview each piece of evidence in your writing against these criteria and check the boxes that apply:\n\n### Relevance (25%)\n- [ ] Evidence directly supports your main argument or thesis\n- [ ] Information is on-topic and necessary for your purpose\n- [ ] Evidence connects logically to your claims\n- [ ] Examples are appropriate for your audience and assignment\n\n### Credibility (25%)\n- [ ] Sources are authoritative and trustworthy (academic journals, recognized experts, etc.)\n- [ ] Information is current and accurate for your topic\n- [ ] Multiple sources confirm key points when appropriate\n- [ ] Sources represent diverse perspectives when relevant\n\n### Citation & Integration (25%)\n- [ ] All sources properly cited in required format (MLA, APA, etc.)\n- [ ] Quotations clearly indicated with quotation marks or block formatting\n- [ ] Paraphrased content properly attributed to original sources\n- [ ] Evidence is smoothly integrated with your own analysis\n\n### Analysis & Application (25%)\n- [ ] You explain why/how the evidence supports your points\n- [ ] Evidence is analyzed, not just presented\n- [ ] Limitations of evidence are acknowledged when necessary\n- [ ] Connections between different pieces of evidence are made clear\n\n## Scoring & Next Steps\nEach section is worth 25% of your total score. You must achieve at least 80% overall to unlock the next unit.\n\n* If you score below 80%, review the feedback and revise your work.\n* Need help? Use the BRYTE AI Tutor or contact the Writing Lab for assistance.\n* Remember: Strong evidence is the foundation of persuasive academic writing!",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson15_Step1_Evidence Checklist.md"
}