{
  "module": "6",
  "lesson": "43",
  "step_number": "1",
  "step_title": "Evidence Synthesis Sprint (Spiral 1)",
  "final_content": "# Evidence Synthesis Sprint (Spiral 1)\n\n## Infographic Template Activity\n\n### Learning Objectives\nBy the end of this activity, you will be able to:\n- Organize research evidence to support a central claim\n- Create a visual representation of your argument\n- Evaluate how different pieces of evidence work together\n\n### Overview\nIn this activity, you'll create a visual representation of your argument using an infographic template. This approach helps you organize your thinking and present evidence effectively to support your central claim.\n\n### Instructions\n1. Download the [Evidence Synthesis Infographic Template](https://link-to-template.com)\n2. In the center circle, write your central claim - this is the main argument you're making\n3. In the three surrounding bubbles, add supporting evidence from your research\n4. For each evidence bubble, include:\n   - A brief description of the evidence (2-3 sentences)\n   - The source citation (author, year)\n   - A 1-2 sentence explanation of how this evidence supports your central claim\n\n### Example\n**Central Claim:** \"Social media has a significant impact on teenage mental health.\"\n\n**Evidence Bubbles:**\n1. **Research Evidence:** Study by Smith & Jones (2022) found teenagers who use social media 3+ hours daily reported 40% higher anxiety levels.\n   **Connection:** This research establishes a direct correlation between heavy social media use and increased anxiety symptoms.\n\n2. **Expert Testimony:** Interviews with five school counselors revealed consistent observations of social media-related stress among students.\n   **Connection:** These front-line professionals provide real-world confirmation of the academic research findings.\n\n3. **Statistical Trends:** CDC data shows a 56% increase in teen depression diagnoses since 2012, coinciding with widespread smartphone adoption.\n   **Connection:** This timeline correlation suggests a possible relationship between social media access and declining mental health.\n\n### Submission Guidelines\n- Complete your infographic using the template provided\n- Save your file as \"LastName_FirstName_EvidenceSynthesis.pdf\"\n- Post to our class forum by the due date\n\n### Forum Sharing\nAfter completing your infographic, post it to our class forum with a brief explanation (150-200 words) of how your evidence works together to support your central claim. Respond to at least two classmates' posts with constructive feedback.\n\n### Grading Criteria\nYour infographic will be evaluated on:\n- Clarity of central claim\n- Quality and relevance of evidence\n- Logical connections between evidence and claim\n- Visual organization and readability\n\n### Support Resources\n- Need help? Use the BRYTE AI Tutor for real-time assistance\n- Visit the Writing Lab for feedback on your evidence explanations\n- Schedule time with your Success Coach if you need additional guidance\n\n### Due Date\nPlease complete and post your infographic by [date].",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson43_Step1_Evidence Synthesis Sprint _Spiral 1_.md"
}