{
  "module": "6",
  "lesson": "3",
  "step_number": "1",
  "step_title": "Process Quiz—“You do”",
  "final_content": "# Process Quiz: Writing Process\n\n## Part 1: Drag and Drop - Order the Writing Process\n\nPlace the following steps in the correct order of the writing process:\n\n1. Choose a topic\n2. Research relevant information\n3. Create an outline\n4. Write a first draft\n5. Take a break from your writing\n6. Revise for content and organization\n7. Get feedback from others\n8. Edit for grammar and punctuation\n9. Make final adjustments\n10. Proofread the final version\n\n## Part 2: Multiple Choice Scenarios\n\n### Scenario 1:\nYou've finished writing your first draft but notice your ideas aren't flowing well.\nWhat should you do next?\n\nA) Submit it anyway since you're finished\nB) Focus on fixing spelling errors\nC) Revise for better organization and clarity ✓\nD) Ask someone else to rewrite it for you\n\n**Explanation:** The revision stage focuses on improving content organization and clarity before moving to grammar and spelling corrections. This is when you evaluate whether your ideas connect logically and your arguments are well-supported.\n\n### Scenario 2:\nYou've received feedback that your conclusion seems disconnected from your introduction.\nWhat writing process step should you return to?\n\nA) Brainstorming\nB) Revision ✓\nC) Editing\nD) Publishing\n\n**Explanation:** When structural issues like disconnected sections are identified, you should return to the revision stage to improve the overall coherence of your writing. During revision, you'll ensure your conclusion effectively ties back to your introduction and main points.\n\n### Scenario 3:\nYou're working on a research paper and feel overwhelmed about where to start.\nWhich step should you focus on first?\n\nA) Choose a specific topic that interests you ✓\nB) Start writing the introduction\nC) Create a detailed bibliography\nD) Look for feedback from peers\n\n**Explanation:** Narrowing down to a specific, manageable topic is the crucial first step in the writing process. This gives you direction and helps make the research phase more focused and efficient.\n\n## Part 3: Short Application\n\nThink about a writing assignment you need to complete soon (or create a hypothetical one if needed). \n\nIn 3-5 sentences, describe:\n1. Which stage of the writing process you typically find most challenging\n2. One specific strategy you could use to overcome this challenge\n3. How you might apply the writing process steps to better manage your time on this assignment\n\n*Note: Your response will be manually reviewed by your instructor.*",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson3_Step1_Process Quiz__You do_.md"
}