{
  "module": "6",
  "lesson": "33",
  "step_number": "1",
  "step_title": "Reflection Quiz—“You do”",
  "final_content": "# Reflection Quiz: Analyzing Writing Depth\n\n## Introduction\nReflection is a critical skill that helps you improve as a writer. This quiz will help you distinguish between surface-level and deep reflection, and identify strategies to enhance your reflective practice.\n\n## Writing Sample Classification\n\nRead the following four excerpts and determine whether each represents **surface-level reflection** or **deep reflection**:\n\n1. \"I finished my essay on time and used proper grammar throughout.\"\n   * This is an example of: _____\n\n2. \"While revising, I noticed my arguments lacked supporting evidence. This pattern appears in my previous essays too, revealing my tendency to make claims without sufficient backup. Next time, I'll gather more research before drafting.\"\n   * This is an example of: _____\n\n3. \"The conclusion of my paper summarizes the main points as required.\"\n   * This is an example of: _____\n\n4. \"I struggled with organization, which made my analysis seem disconnected. This helped me realize I need to outline more thoroughly before writing, especially when dealing with complex topics.\"\n   * This is an example of: _____\n\n## Improving Your Reflection Process\n\nWhich strategies would help deepen your reflection on your writing? (Select all that apply)\n\n- [ ] Identifying specific patterns across multiple writing assignments\n- [ ] Simply noting whether you met deadlines\n- [ ] Analyzing how your writing choices affect your message's impact\n- [ ] Listing the number of words in your essay\n- [ ] Connecting writing challenges to specific skill areas needing development\n\n## Application Exercise\nThink about your most recent writing assignment. Write a brief deep reflection (3-4 sentences) that analyzes a specific aspect of your writing process or outcome. Use the examples of deep reflection above as models.\n\n[Text entry box]",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson33_Step1_Reflection Quiz__You do_.md"
}