{
  "module": "6",
  "lesson": "28",
  "step_number": "1",
  "step_title": "Feedback Quiz—“You do”",
  "final_content": "# Feedback Quiz: Effective vs. Ineffective Feedback\n\nFor each statement below, determine whether it represents **effective** or **ineffective** feedback. Select your answer, then review the explanation.\n\n1. \"Your essay was bad. You need to try harder next time.\"\n   - **INEFFECTIVE**: This feedback is vague, judgmental, and offers no specific guidance for improvement.\n\n2. \"I noticed you used strong evidence in paragraphs 2 and 4. To strengthen your argument further, consider adding specific examples in paragraph 3 as well.\"\n   - **EFFECTIVE**: This feedback is specific, constructive, and provides clear direction for improvement.\n\n3. \"Your presentation was good.\"\n   - **INEFFECTIVE**: While positive, this feedback lacks specificity about what aspects were good or how to maintain quality.\n\n4. \"The organization of your lab report follows the scientific method effectively. Your hypothesis section could be strengthened by connecting it more clearly to your research question.\"\n   - **EFFECTIVE**: This feedback identifies both strengths and provides specific suggestions for improvement.\n\n5. \"I don't understand why you did it this way. This makes no sense.\"\n   - **INEFFECTIVE**: This feedback is judgmental, focuses on the person rather than the work, and offers no constructive guidance.\n\n6. \"Your use of transitions between paragraphs helps the reader follow your argument. Consider applying similar transitions between major sections of your paper.\"\n   - **EFFECTIVE**: This acknowledges what works well and offers specific, actionable suggestions.\n\n7. \"You always make the same mistakes. Didn't you listen in class?\"\n   - **INEFFECTIVE**: This feedback is accusatory, focuses on the person rather than the work, and offers no guidance for improvement.\n\n8. \"Your conclusion effectively summarizes your main points. To strengthen it further, consider addressing the broader implications of your findings.\"\n   - **EFFECTIVE**: This feedback acknowledges strengths and provides specific guidance for enhancement.\n\n9. \"This project shows improvement from your last submission, particularly in how you've incorporated peer feedback about your methodology section.\"\n   - **EFFECTIVE**: This feedback acknowledges growth, is specific about improvements, and reinforces positive changes.\n\n10. \"You need to fix everything about this assignment.\"\n    - **INEFFECTIVE**: This feedback is overwhelming, vague, and provides no specific guidance on what needs improvement or how to approach revisions.\n\n## Key Principles of Effective Feedback\n\nBased on the examples above, effective feedback typically:\n- Focuses on specific aspects of the work rather than the person\n- Balances recognition of strengths with suggestions for improvement\n- Provides clear, actionable guidance for enhancement\n- Uses a supportive, constructive tone\n- Is timely and relevant to learning goals\n\n**Self-Reflection**: Think about feedback you've received recently. Which elements made it helpful or unhelpful? How might you apply these principles when providing feedback to peers?",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson28_Step1_Feedback Quiz__You do_.md"
}