{
  "module": "6",
  "lesson": "37",
  "step_number": "1",
  "step_title": "Portfolio Setup—“We do”",
  "final_content": "# Portfolio Setup: Creating Your Writing Showcase\n\n## Introduction\nWelcome to the hands-on portion of setting up your writing portfolio! In this guided session, we'll work together to establish your digital portfolio, add your first writing sample, and create a meaningful caption. This portfolio will become a valuable collection of your best writing, demonstrating your growth and achievements throughout the course.\n\n## Learning Objectives\nBy the end of this activity, you will be able to:\n- Create a digital portfolio structure in the Excel High School system\n- Upload and properly format a writing sample\n- Craft an effective caption that provides context for your work\n\n## Step 1: Creating Your Portfolio Shell\n\nLet's begin by creating the basic structure for your portfolio:\n\n1. Log in to your Excel High School student dashboard\n2. Navigate to the \"My Portfolio\" section in the main menu\n3. Click on the \"Create New Portfolio\" button\n4. Title your portfolio \"Writing Skills Showcase\" \n5. For the description, write: \"A collection of my best writing samples demonstrating various skills and techniques developed during my coursework\"\n6. Select \"Writing\" as the primary category\n7. Click \"Create Portfolio\" to generate your portfolio shell\n\n**Pro Tip:** Your portfolio shell is now ready! Think of it as an empty display case that we'll gradually fill with your best writing samples. This portfolio will be valuable for college applications, job interviews, or simply tracking your own progress.\n\n## Step 2: Uploading Your First Artifact\n\nNow, let's add your first writing sample:\n\n1. Within your new portfolio, locate and click the \"Add Artifact\" button\n2. Choose \"File Upload\" from the menu options\n3. Select the writing sample you'd like to showcase first (this could be a narrative essay, persuasive piece, poem, or any other completed writing assignment)\n4. Acceptable file formats include: .docx, .pdf, .txt, or .rtf\n5. Maximum file size: 10MB\n6. Once your file is selected, click \"Upload\"\n7. Wait for the upload confirmation message before proceeding\n\n**Troubleshooting:** If you encounter any upload errors, try reducing your file size or converting to a different format. For assistance, contact the Excel High School Support Center via the chat icon in your dashboard.\n\n## Step 3: Writing a Caption\n\nEvery artifact needs context to be fully appreciated. Let's create a caption for your first submission:\n\n1. Under your uploaded artifact, find the \"Add Caption\" field\n2. Write a 2-3 sentence description that includes:\n   - The title and type of writing (essay, story, poem, etc.)\n   - When you created it and for what purpose\n   - One specific writing skill or technique demonstrated in this piece\n3. Click \"Save Caption\" when you're satisfied with your description\n\n**Example Caption:** \"My Personal Narrative: 'The Day Everything Changed' demonstrates my ability to use sensory details and dialogue to create an immersive experience. This piece was written in September 2023 for my Narrative Writing unit and showcases my growth in developing authentic character voice.\"\n\n## Autosave & Progress Tracking\n\nGreat news! The Excel High School portfolio system automatically saves your progress as you work. You'll notice small \"Saved\" notifications appearing periodically. This means you don't have to worry about losing your work if you need to step away.\n\nYour portfolio progress is also tracked in your student dashboard, helping you manage your time effectively across all your coursework.\n\n## Reflection Activity\n\nBefore moving on, take a moment to reflect on your selected writing sample:\n1. Why did you choose this particular piece as your first portfolio artifact?\n2. What specific strengths does this writing demonstrate?\n3. What aspects of your writing would you like to improve in future assignments?\n\nType your reflections in the \"Portfolio Reflections\" text box below your artifact.\n\n## Next Steps\n\nYou've successfully set up your portfolio structure, added your first writing sample, and created a meaningful caption. In our next session, you'll learn how to organize your artifacts into categories and create connections between different pieces of writing.\n\nRemember, your portfolio is a living document that will grow and evolve with your writing skills throughout your time at Excel High School!\n\n## Need Help?\n\nIf you encounter any difficulties with the portfolio setup process:\n- Review the \"Portfolio FAQ\" in the Resources section\n- Contact your Success Coach through the messaging system\n- Visit the Writing Lab during virtual office hours\n- Use the BRYTE AI Tutor for immediate assistance with technical questions",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson37_Step1_Portfolio Setup__We do_.md"
}