{
  "module": "2",
  "lesson": "1",
  "step_number": "13",
  "step_title": "Collaborate in a micro-project",
  "final_content": "# Collaborate in a Micro-Project\n\n## Introduction\nWorking effectively with others is one of the most valuable skills you'll develop during your educational journey at Excel High School and beyond. This activity gives you the opportunity to apply the collaboration principles you've learned by creating a virtual study group and working together on a shared task. The ability to organize a team, assign appropriate roles, and develop a functional plan are skills that will serve you well in higher education and future careers. Let's put these collaboration skills into practice!\n\n## Forming Your Virtual Study Group\n\nTo complete this micro-project, you'll need to form a virtual study group with 2-4 of your peers. You can connect with classmates through Excel High School's approved communication channels:\n- Discussion forums in your course\n- The Student Community area\n- Excel's messaging system\n- Other platforms approved by your Success Coach\n\n**Getting Started:**\n1. Post in the course discussion forum to find group members\n2. Include your time zone and general availability\n3. Mention the project topic you're interested in (see suggestions below)\n4. Exchange contact information using Excel's approved methods\n\nRemember that effective groups typically include members with diverse perspectives and complementary skills. Consider reaching out to classmates you haven't worked with before to broaden your collaborative experience.\n\n## Assigning Roles Within Your Group\n\nFor effective collaboration, each team member should have clearly defined responsibilities. Discuss and assign the following roles:\n\n1. **Coordinator/Leader**: Schedules meetings, keeps discussions on track, and ensures everyone has a chance to contribute.\n\n2. **Recorder/Note-taker**: Documents key decisions, action items, and maintains shared files.\n\n3. **Researcher**: Gathers information or resources needed for the project.\n\n4. **Presenter/Editor**: Polishes the final product and prepares it for submission.\n\n**Pro Tip:** Create a simple role chart that lists each person's name, role(s), and specific responsibilities. This visual reference helps everyone stay accountable.\n\n## Creating Your Collaboration Plan\n\nTogether with your group, develop a brief plan that outlines:\n\n1. **Project Goal**: Choose one of these academic tasks to complete together:\n   - Create study guides for an upcoming exam in one of your courses\n   - Develop a 5-minute presentation on a topic from your current coursework\n   - Solve a set of 3-5 practice problems from a challenging subject\n   - Analyze a case study related to a course you're all taking\n\n2. **Timeline**: Establish a realistic schedule with these checkpoints:\n   - Initial meeting: [Date] - Assign specific tasks\n   - Research/draft deadline: [Date] - Share individual contributions\n   - Review meeting: [Date] - Provide feedback on drafts\n   - Final submission: [Date] - At least 2 days before the assignment due date\n\n3. **Communication Strategy**: \n   - Primary platform: [Choose one: Discussion forum, video chat, messaging]\n   - Check-in frequency: [Daily, every other day, twice weekly]\n   - Response expectation: [Within 24 hours, same day, etc.]\n   - Backup plan: How to proceed if someone doesn't respond\n\n4. **Work Division**: Create a task list showing who is responsible for each specific part of the project.\n\n5. **Feedback Process**: Schedule a specific time to review each other's work and integrate individual contributions.\n\n## Managing Common Challenges\n\n**If a group member isn't responding:**\n- Try reaching out through an alternative approved communication channel\n- Set a reasonable deadline (24-48 hours) for response before notifying your instructor\n- Continue working on your sections while waiting\n\n**If you have conflicting ideas:**\n- Use a \"pros and cons\" approach to evaluate each option objectively\n- Consider combining elements from different suggestions\n- When necessary, make decisions by simple majority vote\n\n## Submission Requirements\n\nOnce you've completed your collaboration, prepare a document (1-2 pages) that includes:\n\n1. Group member names and their assigned roles\n2. Your chosen project/task with a brief description\n3. Your collaboration plan with timeline\n4. A brief reflection (1-2 paragraphs) addressing:\n   - What worked well in your collaboration\n   - What challenges you encountered and how you resolved them\n   - How you'll apply these collaboration skills in future coursework\n\nSubmit your document through the assignment portal by the due date. Each group member must submit the same document individually.\n\nThis micro-project gives you practical experience with collaboration skills that will benefit you throughout your studies at Excel High School and in your future academic and professional endeavors.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/SUSquaredV4_versions/EvalatED\\2\\13_Collaborate in a micro-project.md"
}