{
  "module": "1",
  "lesson": "1",
  "step_number": "5",
  "step_title": "Impact Reflection Submission",
  "final_content": "# Impact Reflection Submission\n\n## Instructions for Completing Your Impact Reflection\n\nNow that you've completed your community service project, it's time to reflect on the impact of your experience—both on the community you served and on your own personal growth.\n\n### What to Submit:\n\n1. **Audio Recording**: Create a 2-3 minute audio recording discussing:\n   - The specific community need you addressed\n   - How your service made a difference\n   - A moment when you experienced or witnessed empathy during your service\n   - How this experience changed your perspective\n\n2. **Written Reflection**: Compose a concise 100-word reflection that captures the essence of your service experience. Focus on:\n   - The most meaningful aspect of your service\n   - How this experience developed your sense of empathy\n   - One way this experience might influence your future actions\n\n### Submission Guidelines:\n\n1. Upload your audio file (MP3 or WAV format)\n2. Type your 100-word reflection in the text box below\n3. Click \"Submit\" when both components are complete\n\n### Success Tips:\n- Use the STAR method (Situation, Task, Action, Result) to structure your audio reflection\n- For your written reflection, try writing a longer draft first, then edit down to 100 words\n- Review the rubric in the Resources section to ensure you've met all requirements\n\n**Important Note**: This submission serves as a mastery gate in your course. Your instructor will review your reflection to ensure you've demonstrated understanding of community impact and empathy before you can proceed to the next concept. You'll receive notification when your submission is approved and the next section is unlocked.\n\n### Resources:\n- [Audio Recording Guide] - Technical help with creating and uploading your recording\n- [Reflection Writing Tips] - Strategies for meaningful reflection\n- [Sample Reflections] - Examples from previous students (with permission)\n\n**Need Help?** Contact your Success Coach through the Student Portal or use the BRYTE AI Tutor for immediate assistance.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/SUSquaredV4_versions/EvalatED\\1\\Lesson1_Step5_Impact Reflection Submission.md"
}