{
  "module": "11",
  "lesson": "1",
  "step_number": "12",
  "step_title": "Social Gratitude Check",
  "final_content": "# Social Gratitude Check\n\n## Learning Objective\nBy completing this assessment, you will demonstrate your understanding of appropriate gratitude expressions in various social contexts, which is an important social-emotional skill for both academic and personal success.\n\n## Instructions\nThis assessment evaluates your understanding of appropriate gratitude expressions in various social contexts. Read each scenario carefully and select the most appropriate response that demonstrates genuine gratitude.\n\nTo pass this assessment, you must answer at least 80% of the questions correctly (4 out of 5 questions).\n\n## Scenarios\n\n1. Your friend helps you study for an important test.\n   a) Say nothing; they were just doing what friends do\n   b) Say \"Thanks\" quickly as you leave\n   c) Say \"I really appreciate you taking time to help me study. It made a big difference.\"\n   d) Promise to buy them lunch sometime\n\n2. A stranger holds the door open for you.\n   a) Ignore them and walk through\n   b) Make eye contact, smile, and say \"Thank you\"\n   c) Say \"You didn't need to do that\"\n   d) Feel embarrassed and hurry through\n\n3. Your parent/guardian makes your favorite meal after you had a difficult day.\n   a) Eat quickly and go to your room\n   b) Say \"Thanks\" while looking at your phone\n   c) Say \"This is exactly what I needed today. Thank you for noticing and making this special meal.\"\n   d) Complain that it's not exactly how you like it\n\n4. A teacher gives you extra help on a challenging assignment.\n   a) Say \"Finally! I've been waiting for help.\"\n   b) Say nothing; it's their job to help\n   c) Say \"Thank you for taking extra time to help me understand this. I appreciate your patience.\"\n   d) Tell other students the teacher plays favorites\n\n5. A teammate encourages you after you make a mistake during a game.\n   a) Ignore them because you're upset\n   b) Say \"I don't need your pity\"\n   c) Say \"Thanks for having my back. It means a lot.\"\n   d) Change the subject quickly\n\n## Why This Matters\nExpressing gratitude appropriately is an essential life skill that:\n- Strengthens relationships with peers, teachers, family, and community members\n- Creates a positive impression in academic and future professional settings\n- Contributes to your own well-being and mental health\n- Helps build a supportive network that can assist you in achieving your goals\n\nAfter completing this assessment, reflect on how you typically express gratitude in your daily life and consider areas where you might improve.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/11 Gratitude\\11\\Lesson1_Step12_Social Gratitude Check.md"
}