{
  "module": "11",
  "lesson": "1",
  "step_number": "11",
  "step_title": "Empathy Map Discussion",
  "final_content": "# Empathy Map Discussion\n\n## Overview\nIn this activity, you will create an empathy map to better understand someone else's perspective, share your map with peers, and provide thoughtful feedback on a classmate's work. This skill will help you build stronger relationships and develop emotional intelligence that's valuable in both personal and professional settings.\n\n## Learning Objectives\nBy completing this activity, you will:\n- Apply empathy mapping techniques to understand others' perspectives\n- Analyze relationships through structured observation\n- Provide constructive peer feedback using specific criteria\n- Reflect on how empathy impacts interpersonal communication\n\n## Empathy Map Template\nAn empathy map helps us visualize and understand another person's experience. Complete your empathy map using the following sections:\n\n1. **THINKS**: What might this person be thinking? What occupies their mind?\n2. **FEELS**: What emotions might they be experiencing? Consider both positive and challenging feelings.\n3. **SAYS**: What do they express verbally? Note specific phrases or communication patterns.\n4. **DOES**: What actions do they take? What behaviors do you observe?\n5. **PAIN POINTS**: What frustrations or challenges do they face?\n6. **GOALS**: What are they trying to achieve? What motivates them?\n\n## Instructions\n\n### Step 1: Create Your Empathy Map (30-40 minutes)\nChoose someone you interact with regularly (family member, friend, classmate) and complete an empathy map from their perspective. Use the template sections above to guide your work.\n\n**Pro Tip:** For best results, focus on a specific situation or context rather than trying to map their entire personality.\n\n### Step 2: Post Your Completed Map (10-15 minutes)\nShare your completed empathy map in the discussion forum. Include:\n- A brief explanation of who you chose (first name or relationship only for privacy)\n- Why understanding their perspective matters to you\n- One insight that surprised you during this process\n\n### Step 3: Peer Evaluation (20-30 minutes)\nReview your classmates' empathy maps and select one to evaluate. Provide constructive feedback using these criteria:\n\n- **Depth of Understanding**: How thoroughly did they explore each section?\n- **Perspective Taking**: Did they effectively step into the other person's shoes?\n- **Insights**: What valuable observations did they make about relationships?\n- **Areas for Growth**: What additional perspectives might they consider?\n\n### Step 4: Guided Feedback Structure\nWhen providing feedback, use this structure:\n- One specific strength you noticed in their empathy map\n- One thoughtful question that might deepen their understanding\n- One suggestion for enhancing their empathy map\n\nRemember that effective feedback is specific, constructive, and respectful.\n\n## Reflection Question\nHow might using empathy mapping improve your relationships with others? Provide at least one specific example of how you could apply this technique in your life.\n\n## Submission Requirements\n- Complete all steps by the due date in your course calendar\n- Your initial post should be 200-300 words\n- Your peer feedback should be 100-150 words\n- Use proper grammar and spelling in all communications\n\n## Need Help?\nIf you have questions about this assignment, contact your Success Coach through the Student Portal or use the BRYTE AI Tutor for immediate assistance.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/11 Gratitude\\11\\Lesson1_Step11_Empathy Map Discussion.md"
}