{
  "module": "12",
  "lesson": "1",
  "step_number": "6",
  "step_title": "Self-Awareness Diagnostic",
  "final_content": "# Self-Awareness Diagnostic\n\n## Introduction\nUnderstanding your academic strengths and areas for improvement is essential for success at Excel High School. This self-awareness diagnostic will help you identify your current study habits, motivation levels, and time-management skills—three key areas that directly impact your online learning success.\n\n## Instructions\nComplete this 12-item questionnaire using the 5-point scale below. Answer honestly for the most accurate results. This diagnostic takes approximately 5 minutes to complete.\n\n**Rating Scale:**\n1 = Strongly Disagree\n2 = Disagree\n3 = Neutral\n4 = Agree\n5 = Strongly Agree\n\n## Diagnostic Quiz\n\n### Study Habits\n1. I take detailed notes during lessons and review them regularly.\n2. I create and follow a structured study plan for each subject.\n3. I actively seek additional resources when I don't understand a concept.\n4. I quiz myself regularly to test my understanding.\n\n### Motivation\n5. I set specific, achievable academic goals for myself.\n6. I remain focused on tasks even when they become challenging.\n7. I connect my current coursework to my future aspirations.\n8. I celebrate my academic achievements, both large and small.\n\n### Time Management\n9. I use a planner or digital tool to track assignments and deadlines.\n10. I prioritize tasks based on importance and urgency.\n11. I avoid procrastination by breaking large assignments into smaller tasks.\n12. I create and maintain a balanced schedule that includes study time and breaks.\n\n## What Happens Next\nAfter completing the assessment, you'll receive an immediate profile report that will:\n- Highlight your strengths (green), moderate areas (yellow), and improvement areas (red)\n- Provide personalized recommendations based on your specific needs\n- Connect you with Excel High School resources designed to enhance your academic skills\n- Offer practical strategies you can implement immediately\n\nYour results are private and will only be used to help customize your learning experience at Excel High School.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/12 Reflection\\12\\Lesson1_Step6_Self-Awareness Diagnostic.md"
}