{
  "module": "2",
  "lesson": "2",
  "step_number": "5",
  "step_title": "Try It: Find the Right Contact",
  "final_content": "# Try It: Find the Right Contact\n\nNavigating the support system at Excel High School will help you solve problems quickly during your online studies. When you know exactly who to contact, you'll get answers faster and avoid the frustration of being bounced between departments. Let's practise matching common questions with the right people who can help.\n\n## Match the Question to the Right Contact\n\n### Instructions\nFor each student question below, select the most appropriate contact method or department at Excel High School. Think about what each situation involves and who would be best equipped to help.\n\n**Student Questions:**\n1. \"I forgot my password and can't log in to my student portal.\"\n2. \"I need to request an official transcript for a college application.\"\n3. \"I don't understand the feedback on my recent English assignment.\"\n4. \"I'm having technical difficulties with the online testing system.\"\n5. \"I need to update my contact information in the school records.\"\n6. \"I have a question about my graduation requirements.\"\n7. \"I need an extension on my assignment due to a family emergency.\"\n8. \"I want to know when my next tuition payment is due.\"\n9. \"I'm struggling to understand a concept in my maths course.\"\n10. \"I want to add another course to my schedule this semester.\"\n\n**Contact Methods:**\n- **Technical Support Team** - For password resets, login issues, and technical problems with the learning platform\n- **Records Department** - For transcript requests, student records, and documentation\n- **Course Teacher** - For subject-specific questions, assignment feedback, and course content clarification\n- **Student Services** - For general questions, guidance on school policies, and administrative support\n- **Academic Advisor** - For questions about graduation requirements, course selection, and academic planning\n- **Billing Department** - For questions about tuition, payment plans, and financial matters\n- **Admissions Department** - For adding or changing courses and enrolment questions\n\n### Correct Matches\n1. \"I forgot my password and can't log in to my student portal.\" → **Technical Support Team**\n2. \"I need to request an official transcript for a college application.\" → **Records Department**\n3. \"I don't understand the feedback on my recent English assignment.\" → **Course Teacher**\n4. \"I'm having technical difficulties with the online testing system.\" → **Technical Support Team**\n5. \"I need to update my contact information in the school records.\" → **Student Services**\n6. \"I have a question about my graduation requirements.\" → **Academic Advisor**\n7. \"I need an extension on my assignment due to a family emergency.\" → **Course Teacher**\n8. \"I want to know when my next tuition payment is due.\" → **Billing Department**\n9. \"I'm struggling to understand a concept in my maths course.\" → **Course Teacher**\n10. \"I want to add another course to my schedule this semester.\" → **Admissions Department**\n\n## Why Contacting the Right Person Matters\n\nSending your question to the appropriate department or staff member makes a real difference:\n\n1. **Faster resolution** - Your issue reaches someone who can help straight away\n2. **Expert assistance** - You get help from someone who really knows that area\n3. **Efficient use of resources** - School staff can focus on their specific responsibilities\n4. **Better student experience** - You avoid being passed from person to person\n\n## Tips for Effective Communication\n\nWhen reaching out for help, keep these points in mind:\n\n1. **Be specific** - Clearly explain your question or issue\n2. **Include relevant details** - Your full name, student ID, and course information when needed\n3. **Use a descriptive subject line** - This helps staff sort and prioritise your request\n4. **Be patient** - Most departments respond within 24-48 business hours (1-2 school days)\n5. **Follow up thoughtfully** - If you haven't heard back in the expected timeframe, a polite follow-up is fine\n\n## Over to You\n\nThink about your experience at Excel High School so far:\n\n1. Which support channel do you think you'll use most often, and why?\n2. How might knowing the right contact person improve your experience as an online student?\n3. What's one question you currently have, and who would be the appropriate person to contact?\n\nRemember, asking for help is a strength, not a weakness. Knowing exactly who to ask just means you'll get back to your studies that much quicker!",
  "editing_explanation": "I've made several key changes to make this content more human-like and appropriate for high school students:\n\n1. Removed the formal \"Introduction\" heading and replaced the generic opening with a more conversational, direct approach\n2. Replaced all instances of \"essential\" with more natural alternatives\n3. Changed American spelling to British spelling (e.g., \"practice\" to \"practise\")\n4. Varied sentence structures to create a more natural flow\n5. Added more conversational elements and direct address to engage teenage learners\n6. Renamed the reflection section to \"Over to You\" as requested\n7. Simplified some complex sentences while maintaining a professional tone\n8. Made the language more concise and direct throughout\n9. Added some rhetorical elements that create a more authentic voice",
  "ai_patterns_detected": 4,
  "output_path": "C:/Users/User/Desktop/ShowupSquaredV4 (2)/ShowupSquaredV4/ShowupSquaredV4/library/Excel Student Orientation\\2\\5_Try It_ Find the Right Contact.md"
}