{
  "module": "10",
  "lesson": "1",
  "step_number": "3",
  "step_title": "Hardware & Internet Requirements",
  "final_content": "# Hardware & Internet Requirements\n\nTo succeed in your online courses at Excel High School, you'll need the right technology setup. This lesson covers what you'll need in terms of devices, internet connection, and email to make your learning experience smooth and trouble-free.\n\n## Device Requirements\n\n### Recommended Devices\nFor the best learning experience at Excel High School, a desktop or laptop computer is strongly recommended. These devices provide the full functionality needed to complete all coursework, assignments, and exams without limitations.\n\n**Desktop/Laptop Computers (Preferred)**\n- Provide full functionality for all course activities\n- Support all required software and browser extensions\n- Allow for proper test proctoring during exams\n- Offer the best experience for typing assignments and navigating course materials\n\n**Chromebooks (Acceptable with Limitations)**\n- Can be used for most coursework and assignments\n- May have limitations with certain interactive elements\n- Acceptable for most activities but may require additional setup for exams\n- Not recommended as your only device if possible\n\n**Tablets and Smartphones (Limited Use)**\n- May be used for reading course materials and watching videos\n- Suitable for checking announcements and grades\n- **NOT permitted for taking exams or quizzes**\n- Not recommended as primary devices due to functionality limitations\n\n> **IMPORTANT:** Tablets and smartphones cannot be used for proctored exams under any circumstances. You must have access to a desktop, laptop, or properly configured Chromebook for all testing situations.\n\n## Internet Requirements\n\nAs a fully online school, Excel High School requires reliable internet access for all students. Your internet connection directly impacts your ability to access course materials, submit assignments, and participate in any scheduled activities.\n\n### Recommended Internet Specifications\n- **Connection Type:** Broadband internet connection (cable, DSL, fibre)\n- **Download Speed:** Minimum 5 Mbps, 10+ Mbps recommended\n- **Upload Speed:** Minimum 1 Mbps, 3+ Mbps recommended\n- **Reliability:** Stable connection with minimal outages\n- **Data Limits:** Unlimited data plan recommended due to video content\n\nMany courses include video lessons, interactive elements, and other multimedia content that require a stable internet connection. Students with unreliable or very slow internet connections may struggle to access these materials.\n\nYou can test your internet speed at [www.speedtest.net](https://www.speedtest.net).\n\n## Computer Specifications Table\n\n| Component | Minimum Requirements | Recommended Specifications |\n|-----------|----------------------|----------------------------|\n| Operating System | Windows 10, macOS 10.14, Chrome OS | Latest version of your OS |\n| Web Browser | Current version of Chrome, Firefox, Edge, or Safari | Chrome or Firefox (latest version) |\n| RAM | 4 GB | 8 GB or more |\n| Processor | 1.6 GHz dual-core | 2.0 GHz quad-core or better |\n| Display Resolution | 1280 x 768 | 1920 x 1080 (Full HD) |\n| Webcam | Required for proctored exams | 720p HD or better |\n| Microphone | Built-in or external | Built-in or external with noise cancellation |\n| Storage | 10 GB available space | 20+ GB available space |\n| Internet Bandwidth | 5 Mbps download / 1 Mbps upload | 10+ Mbps download / 3+ Mbps upload |\n\n## Email Requirements\n\nEach Excel High School student must have their own unique, valid email address. Your email address serves as your primary identification and communication method with the school.\n\n### Email Guidelines:\n1. Use a personal email address you regularly monitor\n2. Make sure the email is not shared with another student or family member\n3. Add Excel High School domains to your safe senders list to prevent important messages from being filtered as spam:\n   - excelhs.com\n   - excelhighschool.com\n   - excelhighschool.org\n\n### Tips for Email Management:\n- Look at your email daily for important announcements\n- Create a folder specifically for Excel High School communications\n- If using Gmail, create a filter to automatically label and prioritise school emails\n- Add the school's contact information to your address book\n- If you don't receive an expected email, look in your spam/junk folder\n\n## Ready-to-Learn Checklist\n\nTo help you prepare for your coursework, we've created a thorough \"Ready-to-Learn\" checklist. This document covers all the technical requirements discussed in this lesson, plus additional preparation steps to help you start successfully.\n\n[Download Ready-to-Learn Checklist](https://www.excelhighschool.com/readytolearn)\n\nThe checklist includes:\n- Detailed hardware verification steps\n- Browser setup instructions\n- Internet connection testing procedures\n- Email configuration guidance\n- Workspace organisation tips\n- Time management suggestions\n- Additional resources for technical support\n\n## Over to You\n1. What device do you plan to use for your Excel High School coursework? Does it meet the minimum requirements outlined above?\n2. Have you experienced any technical challenges with online learning in the past? What strategies might you use to overcome similar challenges at Excel High School?\n3. What backup plan could you implement in case of internet outages or device failures to ensure you stay on track with your coursework?\n\n## Check Your Understanding\n\n1. Which devices are NOT permitted for taking exams at Excel High School?\n   - A. Desktop computers\n   - B. Laptops\n   - C. Chromebooks\n   - D. Tablets and smartphones\n\n2. What is the minimum recommended download speed for Excel High School courses?\n   - A. 1 Mbps\n   - B. 5 Mbps\n   - C. 10 Mbps\n   - D. 20 Mbps\n\n3. What email requirement must all Excel High School students meet?\n   - A. Use a school-provided email address\n   - B. Have a Gmail account\n   - C. Have a unique, valid email address\n   - D. Share an email with a parent or guardian\n\n## Summary\n\nHaving the right technology setup is fundamental for success at Excel High School. Desktop and laptop computers provide the best experience, while Chromebooks can be used with some limitations. Tablets and smartphones should only be used as supplementary devices and are not permitted for exams. A reliable broadband internet connection is necessary for accessing all course materials, especially video content. Each student must have their own valid email address for school communications. The Ready-to-Learn checklist helps you get everything in place before beginning your coursework. With the right preparation, you'll be able to focus on what matters most: your education.",
  "editing_explanation": "I've made several key changes to make this content more human-like and appropriate for high school students:\n\n1. Removed the formal \"Welcome to\" introduction and replaced it with a more direct, practical opening\n2. Replaced all instances of \"essential\" with more natural alternatives\n3. Changed American spelling to British (e.g., \"fiber\" to \"fibre\")\n4. Varied sentence structures and reduced repetitive phrasing\n5. Made the tone more conversational while maintaining professionalism\n6. Added more natural transitions between sections\n7. Simplified some complex sentences while preserving important information\n8. Ensured the \"Over to You\" reflection section is properly labeled\n9. Reduced overuse of words like \"ensure\" and \"check\"\n10. Made the content more relatable to teenage students by adjusting examples and phrasing",
  "ai_patterns_detected": 15,
  "output_path": "C:/Users/User/Desktop/ShowupSquaredV4 (2)/ShowupSquaredV4/ShowupSquaredV4/library/Excel Student Orientation\\10\\3_Hardware _ Internet Requirements.md"
}