{
  "module": "11",
  "lesson": "1",
  "step_number": "1",
  "step_title": "Tuition Options by Program",
  "final_content": "<Analysis>\nI've identified several AI patterns in this text that need humanizing:\n\n1. The formal, detached introduction that starts with \"Understanding the financial investment...\"\n2. Overuse of the word \"program\" and other repetitive terminology\n3. Excessive use of bullet points and structured information without natural flow\n4. Lack of direct address to the student reader in a relatable way\n5. British spelling needed instead of American spelling\n6. Need to replace \"essential\" with more natural alternatives\n7. Need to add \"Over to You\" reflection sections\n8. Overall tone is too formal and lacks the conversational quality that would engage high school students\n\nMy edits focus on creating a more conversational tone while maintaining professionalism, varying sentence structures, using more natural transitions, and making the content more directly relevant to teenage students considering Excel High School.\n</Analysis>\n\n<Edited Text>\n# Tuition Options by Programme\n\nLet's talk about what it costs to study with us at Excel High School. This guide breaks down the fees for different programmes, what you get for your money, and any extra costs you might need to budget for. Having this information upfront helps you plan properly and avoid surprises.\n\n## Programme Tuition Ranges\n\nExcel High School offers several educational paths designed for different academic goals:\n\n### Middle School Programme\nFor students in grades 6-8, tuition typically ranges from $1,200 to $1,500 per academic year. This builds the foundation you'll need before moving to high school.\n\n### Standard High School Diploma Programme (21.5 Credits)\nMeeting basic graduation requirements with 21.5 credits, this option generally costs between $1,500 and $2,000. It provides a solid education that satisfies standard graduation needs.\n\n### College Preparatory Diploma Programme (24 Credits)\nIf you're aiming for university, this more rigorous curriculum with 24 credits costs between $1,800 and $2,300. The higher price reflects the additional coursework and university-readiness focus.\n\n### Advanced Placement (AP) Programme\nLooking for university-level challenges while still in high school? AP courses range from $300 to $450 each and can help you earn university credit through AP exams.\n\n### Adult Diploma Programme\nReturning to complete your high school education? This flexible option for adult learners typically costs between $1,200 and $1,600.\n\n### Individual Courses\nNeed specific credits rather than a full programme? Standard courses typically cost $200-$300, while specialised or higher-level courses may range from $250 to $450.\n\n## What Your Tuition Covers\n\nWhen you join Excel High School, your fees include:\n\n### Core Academic Benefits\n- **Six Credits Per Grade Level**: Your annual tuition covers six full credits of coursework each academic year\n- **24/7 Learning Management System Access**: Study whenever works best for you with unlimited access to our online platform\n- **Success Coach Support**: Personal guidance from a dedicated coach who'll help you navigate your studies\n\n### Additional Included Services\n- **Standard Academic Support**: Teachers who can answer your questions about coursework\n- **Basic Technology Support**: Help with technical issues related to the learning platform\n- **Standard Grading and Feedback**: Regular assessment with constructive feedback to help you improve\n\n## Additional Costs to Consider\n\nBeyond your base tuition, you might encounter these additional fees:\n\n### Course Extension Fees\nNeed more time to finish your coursework? Extension fees typically range from $50 to $100 per course.\n\n### Optional Document Services\n- **Apostille Services**: If you need your diploma or transcripts authenticated for use in another country, this service costs between $75 and $150\n- **Additional Official Transcripts**: While your first transcripts are included, additional official copies cost between $15 and $25 each\n- **Expedited Processing**: For urgent document needs, faster services are available for an additional fee\n\n## Finding Current Pricing Information\n\nTuition and fees may change periodically. For the most up-to-date information:\n\n1. Visit the Excel High School website at www.excelhighschool.com\n2. Click on the \"Tuition & Payment Options\" section\n3. Select your programme of interest to view current rates\n4. Ring an Enrolment Specialist at 1-800-620-3844 if you have questions\n\nOur Enrolment Specialists can provide personalised information about current rates, available discounts, and payment plans.\n\n## Over to You\n\nTake a moment to consider which programme best fits your educational goals and budget. What factors are most important in your decision? Have you explored all the payment options available to you? Jot down any questions you still have about tuition or fees to discuss with an Enrolment Specialist.\n\n## Summary\n\nExcel High School offers various programmes to meet different educational needs, with tuition varying by type. Your fees cover six credits per grade level, round-the-clock access to the learning platform, and Success Coach support. Remember to factor in potential additional costs like course extensions when planning your budget. For the most current pricing information, look at our website or speak with an Enrolment Specialist who can guide you based on your specific goals.",
  "editing_explanation": "No explanation provided.",
  "ai_patterns_detected": 25,
  "output_path": "C:/Users/User/Desktop/ShowupSquaredV4 (2)/ShowupSquaredV4/ShowupSquaredV4/library/Excel Student Orientation\\11\\1_Tuition Options by Program.md"
}