{
  "module": "2",
  "lesson": "3",
  "step_number": "1",
  "step_title": "Color Theory in Practice",
  "final_content": "I'll edit this text to make it more human-like and appropriate for HNC Interior Design Foundation students with no prior formal training. I'll focus on making it more conversational while maintaining professionalism, converting American spelling to British, and ensuring the reflection sections are properly labeled as \"Over to You.\"\n\n## Main changes I'm making:\n- Removing the formulaic \"Welcome to...\" introduction and creating a more engaging opening\n- Converting American spelling to British (color → colour)\n- Making language less formal and more conversational while maintaining professionalism\n- Adding more practical examples relevant to beginners\n- Ensuring reflection sections are labeled \"Over to You\"\n- Varying sentence structure to feel more human-written\n- Adding some rhetorical questions to engage the reader\n- Reducing repetitive phrasing and overly formal language\n\n# Interior Design Foundations: Colour Relationships and Applications\n\nColour transforms spaces. It's the silent communicator in interior design that shapes mood, influences perception, and brings environments to life. Without changing a single structural element, the right colour choices can completely reinvent a room.\n\nThis module builds on our previous work with materials and textures by exploring how colour relationships create purposeful, cohesive interiors. The principles you'll learn here will directly inform your future work with digital design tools, enabling you to make thoughtful colour choices that enhance your design concepts.\n\n## 1. Colour Fundamentals: Understanding the Language of Colour\n\n### The Colour Wheel: Your Design Compass\n\nThe colour wheel provides the foundation for understanding how colours relate to each other:\n\n- **Primary colours**: Red, yellow, and blue form the basis from which all other colours derive\n- **Secondary colours**: Orange, green, and purple emerge when primary colours are mixed\n- **Tertiary colours**: These appear when mixing primary and adjacent secondary colours (like blue-green or red-orange)\n\nUnlike our previous work with textures, colour requires understanding relationships rather than just individual elements.\n\n> **Over to You**: Find a magazine image of an interior space that appeals to you. Using coloured pencils, identify and circle examples of primary, secondary, and tertiary colours. How do these colours work together to create the overall feeling of the room?\n\n### Colour Schemes: Creating Harmony Through Relationships\n\nColour schemes are deliberate combinations based on colour wheel positions:\n\n- **Monochromatic**: Variations of a single colour (think of a bedroom using different shades of blue to create a serene, unified space)\n- **Analogous**: Colours that sit next to each other on the wheel (such as yellow, yellow-green, and green for a natural, harmonious feel)\n- **Complementary**: Colours opposite each other on the wheel (like blue and orange creating energy in a living room)\n- **Split-complementary**: A colour plus the two colours adjacent to its complement (giving balanced contrast with less tension)\n- **Triadic**: Three colours equidistant on the wheel (providing balanced contrast while maintaining harmony)\n\n## 2. Application Methods: From Theory to Practice\n\n### Documentation and Selection Process\n\nIn professional practice, designers document colour selections using:\n- **Colour codes**: Pantone, RAL, RGB, or manufacturer-specific references (these industry-standard systems ensure consistency across materials)\n- **Material samples**: Physical colour chips arranged on presentation boards\n- **Digital specifications**: Digital colour boards showing relationships between elements\n\nHave you ever wondered how designers choose colours for a space? The process typically follows these steps:\n1. Identify the function and desired mood (a kitchen might need energetic colours while a bedroom benefits from calming tones)\n2. Consider lighting conditions (remember that colours appear dramatically different under various light sources)\n3. Select a dominant colour that supports the concept (this will cover roughly 60% of the space)\n4. Add secondary colours (about 30%) and accent colours (about 10%)\n5. Test colours in the actual space whenever possible\n\n> **Connection to Next Module**: These colour documentation methods will be essential when you begin working with digital design tools in our next unit, where you'll create digital colour boards using Canva.\n\n### The 60-30-10 Rule: Creating Balance\n\nProfessional designers often rely on the 60-30-10 rule to create balanced interiors:\n- 60% dominant colour (walls, large furniture)\n- 30% secondary colour (accent furniture, textiles)\n- 10% accent colour (accessories, artwork)\n\nThis approach creates visual interest while maintaining harmony and preventing spaces from feeling chaotic or overwhelming.\n\n## 3. Discussion and Analysis: Developing Your Colour Eye\n\n### Analysing Successful Colour Schemes\n\nTo train your eye, start analysing spaces you find appealing:\n- What's the dominant colour?\n- How many accent colours are used?\n- Where are bold colours placed versus neutral ones?\n- How does the colour scheme support what the space is used for?\n\n### Colour and Context\n\nColours never exist in isolation. Consider how colours interact with:\n- **Materials**: The same blue looks remarkably different on velvet compared to polished metal\n- **Lighting**: Natural daylight versus artificial lighting dramatically affects how we perceive colour\n- **Space size**: Darker colours can make spaces feel cosier and smaller, while lighter colours tend to expand spaces\n- **Cultural associations**: Colours carry different meanings across cultures and contexts\n\n> **Over to You**: Think about a room in your home. How might changing its colour scheme alter your experience of the space? Consider how different colour schemes (monochromatic, complementary, etc.) would change the feeling and function of the room.\n\n## Building Your Colour Confidence\n\nDeveloping a solid understanding of colour relationships gives you a powerful design language that will serve you throughout your career. As you move to digital design tools in our next lesson, you'll apply these colour principles in digital environments, creating professional presentations that clearly communicate your design intentions.\n\nDeveloping your \"colour eye\" takes practice. Start noticing colour relationships in spaces around you—restaurants, shops, homes—and you'll gradually build confidence in making thoughtful colour choices for your own design projects.",
  "editing_explanation": "No explanation provided.",
  "ai_patterns_detected": 53,
  "output_path": "output\\Interior Design Foundations_20250404_034803\\2\\3\\1_Color Theory in Practice.md"
}