{
  "module": "10",
  "lesson": "2",
  "step_number": "4",
  "step_title": "Storyboard a Micro-Video on Kindness Impact",
  "final_content": "# Storyboard a Micro-Video on Kindness Impact\n\n## Overview\nIn this activity, you will create a storyboard for a 60-second micro-video that demonstrates how a single act of kindness can create ripple effects throughout a community. Your storyboard will help you plan your video before production, ensuring your message about kindness is clear and impactful.\n\n## Learning Objectives\nBy completing this activity, you will:\n- Plan and organize a short video narrative with a clear beginning, middle, and end\n- Demonstrate understanding of how positive actions can influence others\n- Practice visual storytelling techniques through storyboarding\n\n## Storyboard Template Instructions\n\nYour storyboard will consist of six panels, each representing approximately 10 seconds of your micro-video. Use the template below to plan each panel:\n\n### Panel 1: Situation (0-10 seconds)\n- **Visual Notes:** Establish the setting and character(s) facing a challenge\n- **Description:** Briefly describe the scene, characters, and situation\n- **Audio Notes:** What sounds or dialogue will accompany this scene?\n\n### Panel 2: Kind Act (10-20 seconds)\n- **Visual Notes:** Show someone performing an act of kindness\n- **Description:** Detail the specific kind action being taken\n- **Audio Notes:** What sounds or dialogue will accompany this scene?\n\n### Panel 3: Immediate Effect (20-30 seconds)\n- **Visual Notes:** Show the direct impact on the recipient\n- **Description:** How does the recipient respond? What changes?\n- **Audio Notes:** What sounds or dialogue will accompany this scene?\n\n### Panel 4: Ripple Effect (30-40 seconds)\n- **Visual Notes:** Show how the kindness spreads to others\n- **Description:** How does the initial act inspire others or create a chain reaction?\n- **Audio Notes:** What sounds or dialogue will accompany this scene?\n\n### Panel 5: Call-to-Action (40-50 seconds)\n- **Visual Notes:** Direct address to viewers about how they can show kindness\n- **Description:** What specific action are you encouraging viewers to take?\n- **Audio Notes:** What sounds or dialogue will accompany this scene?\n\n### Panel 6: Closing Text (50-60 seconds)\n- **Visual Notes:** Final message or quote about kindness\n- **Description:** What text will appear on screen to summarize your message?\n- **Audio Notes:** What sounds or music will accompany this final scene?\n\n## Tips for Creating Your Storyboard\n- Keep your story simple but meaningful\n- Use arrows to show movement or transitions between panels\n- Include notes about camera angles (close-up, wide shot, etc.)\n- Consider using different colors to highlight emotions or tone shifts\n- Remember that each panel represents approximately 10 seconds of video\n\n## Example Themes to Consider\n- Helping a new student feel welcome\n- Supporting someone who is struggling academically or emotionally\n- Random acts of kindness in your school or community\n- Standing up for someone experiencing bullying\n- Small gestures that make a big difference in someone's day\n\n## Submission Guidelines\n1. Create your storyboard using the template provided in the assignment area\n2. Include all six panels with complete visual notes, descriptions, and audio notes\n3. Submit your completed storyboard through the assignment portal\n4. Your work will be evaluated on creativity, clarity of message, and adherence to the storyboard format\n\n## Need Help?\n- Visit the Writing Lab for feedback on your storyboard narrative\n- Use BRYTE AI Tutor for real-time assistance with planning your video concept\n- Schedule time with your Success Coach if you need additional support\n\nYour completed storyboard will serve as the blueprint for creating a powerful micro-video about how kindness creates positive change in our world.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/10 Kindness\\10\\Lesson2_Step4_Storyboard a Micro-Video on Kindness Impact.md"
}