{
  "module": "10",
  "lesson": "8",
  "step_number": "2",
  "step_title": "Portfolio Template Walkthrough",
  "final_content": "# Portfolio Template Walkthrough\n\n## Introduction\nWelcome to your Kindness & Empathy Portfolio tutorial! This walkthrough will guide you through using the portfolio template to document your acts of kindness and your reflections on empathy. By the end of this tutorial, you'll be comfortable navigating the template, adding evidence links, and writing meaningful captions.\n\n## Navigating the Template Sections\n\nThe portfolio template is divided into four main sections:\n\n1. **Personal Introduction** - Where you'll introduce yourself and your goals\n2. **Acts of Kindness Documentation** - Where you'll record specific kind actions\n3. **Empathy Reflections** - Where you'll reflect on experiences of understanding others\n4. **Growth Summary** - Where you'll summarize what you've learned\n\n**PAUSE POINT:** Take a moment to open your portfolio template and identify these four sections. Make sure you can locate each one before continuing.\n\n## Adding Evidence Links\n\nFor each act of kindness or empathy reflection, you'll want to include evidence:\n\n1. Click in the \"Evidence\" box in your template\n2. Select the \"Insert Link\" icon in your toolbar (it looks like a chain link)\n3. Paste the URL of your evidence (could be a photo, document, or other digital artifact)\n4. Add a descriptive name for your link (e.g., \"Volunteer Certificate\" or \"Reflection Journal Entry\")\n\n**Examples of Evidence:**\n* Photos of you participating in community service\n* Screenshots of thank-you messages\n* Journal entries reflecting on your experiences\n* Videos of presentations or activities\n* Certificates or recognition documents\n\n**PAUSE POINT:** Practice adding a sample evidence link to one section of your portfolio. This could be a placeholder that you'll replace later.\n\n## Writing Effective Captions\n\nCaptions explain your evidence and connect it to kindness and empathy concepts:\n\n1. Click in the \"Caption\" field beneath your evidence\n2. Write 2-3 sentences that:\n   - Describe what the evidence shows\n   - Explain how it demonstrates kindness or empathy\n   - Reflect on the impact of the action\n\n**Strong Caption Example:** \"This photo shows me helping my neighbor carry groceries. I noticed she was struggling with heavy bags and offered assistance. This small act brightened her day and reminded me how simple kindness can make a difference.\"\n\n**Weak Caption Example:** \"This is me helping someone.\" (Too vague, lacks reflection and detail)\n\n**PAUSE POINT:** Practice writing a sample caption for the evidence link you added earlier.\n\n## Troubleshooting Common Issues\n\n**If you can't add a link:**\n* Make sure you're clicking directly in the Evidence box\n* Check that you have the complete URL (starting with http:// or https://)\n* Try refreshing your browser if the toolbar isn't appearing\n\n**If you're struggling with what to write:**\n* Start by simply describing what happened\n* Then add how you felt during the experience\n* Finally, connect to how this relates to kindness or empathy\n\n## Final Tips\n\n- Update your portfolio regularly as you complete kind acts\n- Use specific, detailed descriptions rather than general statements\n- Include both what you did and how it affected others\n- Reflect on how these experiences changed your perspective\n- Set a reminder to add new entries weekly or monthly\n\nRemember, your portfolio should tell the story of your kindness journey and demonstrate your growing understanding of empathy in action.\n\n**PAUSE POINT:** Review your template now. Make sure you understand how all sections work together to create a complete portfolio.\n\n**Need Help?** If you have questions about your portfolio, reach out to your Success Coach through the Excel High School Student Portal.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/10 Kindness\\10\\Lesson8_Step2_Portfolio Template Walkthrough.md"
}