{
  "module": "10",
  "lesson": "11",
  "step_number": "1",
  "step_title": "Integrated Kindness Capstone",
  "final_content": "# Integrated Kindness Capstone\n\n## Final Portfolio Requirements\n\nYour Integrated Kindness journey culminates in this capstone project. To successfully complete this course, you will:\n\n1. **Compile your final portfolio** containing all kindness artifacts created throughout the course\n2. **Record a 3-minute video reflection** connecting your artifacts to the learning outcomes\n3. **Submit everything** through the assessment tool in your Excel High School student portal\n\n## Portfolio Contents\nYour portfolio should include:\n- All completed kindness activities from each module\n- Your kindness journal entries\n- Community service documentation\n- Any additional kindness projects you've completed\n\n## Video Reflection Guidelines\nIn your 3-minute reflection video:\n- Introduce yourself and briefly summarize your Integrated Kindness journey\n- Select 2-3 of your most meaningful artifacts and explain:\n  - What you created and why\n  - How it demonstrates your understanding of specific kindness concepts\n  - How this learning has impacted your daily life\n- Conclude with how you plan to continue practicing kindness beyond this course\n\nNeed help recording? Visit the Excel Student Success Center for video creation tutorials.\n\n## Assessment Method\nYour submission will be evaluated using a rubric that scores:\n- Portfolio completeness (all required artifacts included)\n- Reflection quality (clear connections between artifacts and learning outcomes)\n- Evidence of personal growth and application of kindness principles\n\nYou may resubmit your work if needed to demonstrate mastery of integrated kindness concepts.\n\n## Submission Timeline\n- Portfolio and video due: By your selected completion date\n- Feedback provided: Within 3-5 business days\n- Optional resubmission: Within 7 days of receiving feedback\n\nNeed assistance? Contact your Excel Success Coach through your student portal.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/10 Kindness\\10\\Lesson11_Step1_Integrated Kindness Capstone.md"
}