{
  "module": "10",
  "lesson": "7",
  "step_number": "3",
  "step_title": "Weekly Reflection Post",
  "final_content": "# Weekly Reflection Post: Kindness Journal\n\n## Overview\nReflecting on our kindness efforts helps us grow as compassionate individuals. This weekly practice encourages you to think critically about your actions, celebrate successes, learn from challenges, and set meaningful goals for continued growth.\n\n## Learning Objectives\nBy completing this weekly reflection, you will:\n- Develop self-awareness about your kindness practices\n- Build critical reflection skills\n- Set achievable goals for personal growth\n- Strengthen your ability to give constructive peer feedback\n\n## Weekly Reflection Blog Prompt\n\nEach week, you'll create a reflection post that includes three key components:\n\n### 1. Summary of Your Kindness Efforts (20-100 words)\nBegin by summarizing the acts of kindness you engaged in this week. Consider:\n- What specific kind actions did you take?\n- Were these planned or spontaneous?\n- Who was affected by your kindness?\n- How did these actions align with your values?\n\n### 2. Analysis of Success and Obstacles (50-150 words)\nThoughtfully analyze your kindness journey this week:\n- **Successes**: Which acts of kindness felt most meaningful? How did they impact others? What positive feelings or outcomes resulted?\n- **Obstacles**: What challenges did you face in practicing kindness? Were there missed opportunities? What internal or external barriers made kindness difficult?\n- **Insights**: What did you learn about yourself, others, or the nature of kindness through these experiences?\n\n### 3. Setting a Micro-Goal (25-50 words)\nBased on your reflection, set one specific, achievable micro-goal for the coming week:\n- Make it concrete and measurable\n- Focus on a specific aspect of kindness you want to develop\n- Consider addressing an obstacle you identified\n- Keep it small enough to be realistic but meaningful enough to matter\n\n**Example micro-goals:**\n- \"I will give three specific compliments to classmates who are usually quiet.\"\n- \"I will practice patience when my younger sibling interrupts my homework.\"\n- \"I will write one thank-you note to someone whose help I've taken for granted.\"\n\n## Submission Guidelines\n- Post your reflection to the class discussion board by Sunday at 11:59 PM\n- Word count: 100-300 words total\n- Use the title format: \"Week [#] Kindness Reflection - [Your Name]\"\n- Respond to at least two classmates' posts by Tuesday at 11:59 PM\n\n## Peer Reply Guidelines\n\nAn important part of our kindness community is supporting each other's growth. When responding to your peers' reflection posts:\n\n1. **Be Specific**: Reference particular details from their reflection rather than giving generic comments.\n\n2. **Affirm Efforts**: Acknowledge the work they've done and the self-awareness they've shown.\n\n3. **Ask Thoughtful Questions**: Pose at least one question that might help them deepen their reflection.\n\n4. **Offer Encouragement**: Share words of support for their micro-goal or for overcoming obstacles they identified.\n\n5. **Share Connections**: If appropriate, briefly mention how their experience resonates with your own journey.\n\n## Example Reflection Post\n\n\"This week, I focused on being kind to new students. I invited Sara to join our lunch table twice and helped Alex find his way to the gym when he looked lost. I also tried to be more patient with my dad when he asks me to help with chores, though I struggled with this on Thursday when I was stressed about my math test.\n\nI felt most successful when helping Alex, because his relief was immediately visible and it reminded me how scary it can be to navigate a new school. My biggest obstacle was maintaining kindness when I felt stressed or rushed. I noticed I was less likely to hold doors or greet people on days when I was running late.\n\nMy micro-goal for next week: I will take three deep breaths before responding when I feel irritated or impatient, especially with family members after school when I'm tired.\"\n\n## Grading Criteria\nYour weekly reflection will be evaluated based on:\n- Thoughtfulness and depth of reflection (40%)\n- Specificity of examples and insights (30%)\n- Quality of your micro-goal (15%)\n- Quality of peer responses (15%)\n\nRemember, the purpose of these reflections is not to showcase perfection but to demonstrate growth and self-awareness in your kindness journey.\n\n## Need Help?\n- Use the BRYTE AI Tutor for guidance on reflection writing\n- Visit the Writing Lab for feedback on your draft\n- Message your Success Coach if you're struggling with the assignment",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/10 Kindness\\10\\Lesson7_Step3_Weekly Reflection Post.md"
}