{
  "module": "1",
  "lesson": "9",
  "step_number": "43",
  "step_title": "Curate Artefacts",
  "final_content": "# Curate Artifacts for Your Perseverance & Grit Portfolio\n\n## Introduction\nCreating a comprehensive portfolio that showcases your journey with perseverance and grit requires thoughtful curation of meaningful artifacts. This lesson guides you through selecting and presenting three essential components that will strengthen your portfolio and demonstrate your growth mindset.\n\n## Learning Objectives\nBy the end of this lesson, you will be able to:\n- Select appropriate artifacts that demonstrate your understanding of perseverance\n- Create clear captions and alt text for accessibility\n- Develop a cohesive portfolio that tells your personal growth story\n\n## Required Artifacts Checklist\n\n### 1. Perseverance Infographic\nCreate a visually appealing infographic that represents your understanding of perseverance and grit concepts. This visual element should capture key strategies, benefits, or personal insights about developing resilience in a specific area of your life.\n\n**Caption requirement:** Write a single sentence (25 words or less) that summarizes what your infographic demonstrates about your understanding of perseverance.\n\n**Example caption:** \"This infographic illustrates the five key strategies I use to maintain motivation when facing challenges in physical activities.\"\n\n**Alt text requirement:** Create descriptive alt text (50-100 words) that explains the infographic's content and purpose for screen reader accessibility.\n\n**Example alt text:** \"Infographic showing five perseverance strategies: goal-setting, positive self-talk, visualization, breaking tasks into smaller steps, and celebrating small wins, with icons and brief descriptions for each.\"\n\n**Pro Tip:** Use free tools like Canva, Piktochart, or Google Drawings to create your infographic. Focus on clarity and visual appeal rather than complex design.\n\n### 2. Personal Action Plan\n\nDevelop an action plan that outlines specific steps you'll take to build greater perseverance in a particular area of your life. This document demonstrates your ability to apply perseverance concepts practically and set achievable goals.\n\n**Caption requirement:** Write a single sentence (25 words or less) that explains what your action plan aims to accomplish.\n\n**Example caption:** \"My six-week action plan details how I will progressively build stamina for my 5K training despite previous setbacks.\"\n\n**Alt text requirement:** Create descriptive alt text (50-100 words) that summarizes your action plan's structure and purpose.\n\n**Example alt text:** \"A structured action plan with weekly goals, potential obstacles, and strategies for maintaining motivation during 5K training, organized in a timeline format with checkpoints.\"\n\n**Action Plan Components:**\n- Specific goal or challenge\n- Timeline with milestones\n- Potential obstacles and solutions\n- Resources needed\n- Success metrics\n- Reflection space\n\n### 3. Personal Commitment Contract\n\nCreate a contract with yourself that outlines your commitment to persevering through a specific challenge. This document represents your personal accountability and determination to overcome obstacles.\n\n**Caption requirement:** Write a single sentence (25 words or less) that captures the essence of your commitment.\n\n**Example caption:** \"This personal contract represents my commitment to practicing basketball skills for 30 minutes daily, even when progress feels slow.\"\n\n**Alt text requirement:** Create descriptive alt text (50-100 words) that explains the contract's purpose and key components.\n\n**Example alt text:** \"A formal personal contract with sections for specific commitments, accountability measures, rewards for milestone achievements, and signature, focused on consistent basketball skill development.\"\n\n**Contract Elements to Include:**\n- Specific, measurable commitment\n- Timeframe\n- Accountability method\n- Rewards for milestone achievements\n- Consequences for breaking the contract\n- Your signature and date\n\n## Submission Guidelines\n\nEnsure each artifact is:\n- Clearly labeled with your name and artifact type\n- Saved in an accessible format (PDF recommended)\n- Accompanied by its one-sentence caption\n- Includes appropriate alt text for accessibility\n- Demonstrates thoughtful application of perseverance concepts\n\n## Reflection Questions\nBefore finalizing your submission, consider:\n1. How do these artifacts collectively tell the story of your growth?\n2. Which artifact was most challenging to create, and why?\n3. How might these tools help you persevere in future challenges?\n\nRemember, these artifacts should authentically reflect your personal journey with perseverance and grit. Choose examples that genuinely represent your experiences and learning.\n\n## Need Help?\nIf you have questions about this assignment, contact your Success Coach through the Excel High School Student Portal or use the BRYTE AI Tutor for immediate assistance.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED\\1\\Lesson9_Step43_Curate Artefacts.md"
}