{
  "module": "1",
  "lesson": "1",
  "step_number": "2",
  "step_title": "Worked Examples—Spot the Grit",
  "final_content": "# Worked Examples—Spot the Grit\n\n## Introduction\nIn this lesson, we'll analyze two real-life situations to identify signs of perseverance and grit. By recognizing these qualities in action, you'll develop a deeper understanding of how they appear in everyday life and how you can apply them to your own challenges.\n\n## Learning Objectives\nBy the end of this lesson, you will be able to:\n- Identify specific behaviors that demonstrate grit and perseverance\n- Analyze how individuals overcome obstacles through sustained effort\n- Apply these concepts to reflect on your own experiences with perseverance\n\n## Vignette 1: The Marathon Runner\n\n> Maya decided to run a marathon despite never having run more than a mile before. <span style=\"background-color: yellow\">She created a six-month training plan</span> and began waking up at 5 AM daily. <span style=\"background-color: orange\">During month three, she developed shin splints but consulted a physical therapist instead of quitting</span>. She modified her training but <span style=\"background-color: yellow\">continued working toward her goal</span>. On race day, <span style=\"background-color: orange\">at mile 20, she hit \"the wall\" where her body wanted to stop, but she pushed through</span> by focusing on her breathing and remembering her training journey. <span style=\"background-color: yellow\">She finished the marathon in just under 5 hours</span>, achieving her personal goal.\n\n### Pause and Think\nWhat specific actions show Maya's grit? How did she demonstrate perseverance when facing obstacles?\n\n<details>\n<summary>**Hint**</summary>\nLook for moments when Maya faced challenges but continued anyway, and notice her long-term commitment to her goal.\n</details>\n\n<details>\n<summary>**Model Answer**</summary>\nMaya demonstrated grit through her long-term commitment (six-month training plan) and consistent early-morning training. Her perseverance was evident when she sought solutions to her shin splints rather than quitting. The ultimate display of grit came when she pushed through \"the wall\" at mile 20, showing her ability to overcome both physical and mental barriers to achieve her goal.\n</details>\n\n## Vignette 2: The Coding Student\n\n> Jamal enrolled in a coding bootcamp with no prior experience. <span style=\"background-color: yellow\">He spent two hours every evening after work practicing</span>, even when tired. <span style=\"background-color: orange\">When his first project received critical feedback, he felt discouraged but asked his instructor for additional guidance</span>. <span style=\"background-color: yellow\">He revised his approach and put in extra weekend hours</span> to improve. <span style=\"background-color: orange\">During the final project, his computer crashed, losing three days of work. Instead of panicking, he took a deep breath, retrieved what he could from backups, and rebuilt the rest</span>. <span style=\"background-color: yellow\">He graduated with a portfolio strong enough to land a junior developer position</span>.\n\n### Pause and Think\nHow did Jamal's response to setbacks demonstrate grit? What patterns do you notice in how he approached challenges?\n\n<details>\n<summary>**Hint**</summary>\nConsider how Jamal responded emotionally to setbacks and what actions he took afterward. Look for consistency in his approach.\n</details>\n\n<details>\n<summary>**Model Answer**</summary>\nJamal's grit was evident in his consistent daily practice despite fatigue. When faced with criticism, he demonstrated perseverance by seeking help rather than giving up. His response to losing work showed remarkable resilience—he managed his emotions and immediately took action to solve the problem. Throughout his journey, Jamal maintained a pattern of facing obstacles directly, finding solutions, and putting in extra effort when needed. His passion for coding and perseverance through multiple challenges exemplify true grit.\n</details>\n\n## Key Takeaways\n- Grit involves both passion (sustained interest) and perseverance (overcoming obstacles)\n- People with grit:\n  - Set long-term goals and create plans to achieve them\n  - Maintain consistent effort over time\n  - Seek solutions rather than giving up when faced with setbacks\n  - Manage their emotions during challenges\n  - Focus on what they can control\n\n## Your Turn: Personal Reflection\nThink about your own life. Can you identify a situation where you've shown grit similar to Maya or Jamal? \n\nIn your reflection, consider:\n1. What was your long-term goal?\n2. What obstacles did you face?\n3. How did you respond to these challenges?\n4. What specific actions demonstrated your perseverance?\n5. What did you learn from this experience that you can apply to future challenges?\n\n*Remember: Developing grit is a process. Even identifying small moments of perseverance in your life can help you build this important quality over time.*",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED\\1\\Lesson1_Step2_Worked Examples_Spot the Grit.md"
}