{
  "module": "1",
  "lesson": "7",
  "step_number": "34",
  "step_title": "Peer Support Action",
  "final_content": "# Peer Support Action Worksheet\n\n## Introduction\nBuilding perseverance and grit isn't just about individual effort—it's also about community support. This activity will help you practice giving and receiving encouragement through peer support exchanges. Over the next two weeks, you'll engage in structured message exchanges with a classmate, providing mutual support and reflecting on the impact of these interactions.\n\n## Learning Objectives\nBy completing this activity, you will:\n* Practice giving and receiving constructive feedback\n* Develop strategies for overcoming challenges\n* Strengthen your perseverance skills through community support\n* Reflect on the impact of peer encouragement on motivation\n\n## Schedule and Instructions\n\n### Week 1-2: Three Message Exchanges\n1. **First Exchange (Day 1-3)**: Share a current challenge you're facing that requires perseverance. Your peer will respond with encouragement and advice.\n\n2. **Second Exchange (Day 4-7)**: Update your peer on your progress and any obstacles you've encountered. Your peer will offer additional support strategies.\n\n3. **Final Exchange (Day 8-14)**: Share your outcomes, whether you succeeded or are still working toward your goal. Your peer will acknowledge your efforts and perseverance.\n\n## Message Guidelines\n* Be specific about the challenge you're facing\n* Include how you're feeling about the situation\n* Ask for specific types of support if needed\n* When responding to your peer, offer genuine encouragement\n* Share personal experiences or strategies that might help\n\n## Example Exchange\n**Student A:** \"I'm struggling to complete my Algebra module because I find the concepts confusing, especially when working alone. I feel frustrated and worried about falling behind. Could you share any study techniques that have worked for you?\"\n\n**Student B:** \"I understand that frustration! Last semester, I broke down complex problems into smaller steps and used Khan Academy videos alongside the course material. Have you tried reaching out to the Excel Success Coach? They helped me create a study schedule that made the work more manageable.\"\n\n## Reflection Questions\nAfter completing all three exchanges, answer the following questions:\n\n1. How did receiving encouragement from your peer affect your motivation to persevere?\n2. What specific advice or support strategies were most helpful to you?\n3. How did providing support to your peer impact your own approach to challenges?\n4. What did you learn about the role of community in building perseverance?\n5. How might you incorporate peer support into future challenges?\n\n## Documenting Your Exchanges\n\n### Screenshot Guide\nTo provide evidence of your completed activity:\n\n1. Take screenshots of each message exchange (3 total)\n2. Make sure each screenshot shows:\n   * The date of the exchange\n   * Both your message and your peer's response\n   * Key elements of encouragement or support\n   \n3. Save screenshots with filenames that include:\n   * Your name\n   * Exchange number (1, 2, or 3)\n   * Date\n   \nExample: \"JSmith_Exchange1_Sept15.jpg\"\n\n### Submission Requirements\nSubmit your three screenshots along with your completed reflection questions by the assignment due date. Your submission demonstrates your ability to both give and receive support—essential skills for building collective perseverance.\n\n### Technical Support\nIf you encounter any difficulties with the messaging system or taking screenshots, please contact your Success Coach or use the Excel High School Help Center through your Student Portal.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED\\1\\Lesson7_Step34_Peer Support Action.md"
}