{
  "module": "6",
  "lesson": "17",
  "step_number": "1",
  "step_title": "Error Hunt—“We do”",
  "final_content": "# Error Hunt—\"We do\"\n\n## Introduction\nIn this activity, we'll work together to identify and correct common writing errors. This guided practice will help you develop your proofreading skills, which are essential for effective writing.\n\n## Learning Objectives\nBy the end of this activity, you will be able to:\n- Identify common grammar and punctuation errors\n- Apply appropriate grammar rules to correct writing mistakes\n- Develop effective proofreading strategies\n\n## Paragraph Error Hunt\n\nRead the following paragraph carefully. It contains several errors. For each highlighted section, you'll identify the error, select the grammar rule that applies, and correct the text.\n\n---\n\n**Many students** [struggle with writing because they don't understand the basic rules of grammar and punctuation]{.error1} **When writing an essay,** [its important to proofread your work carefully]{.error2} **Effective writers know that** [good writing take time and practice]{.error3} **If you want to improve,** [you should read you're work out loud]{.error4} **This technique helps** [writers catch errors they might otherwise miss when reading silently.]{.error5}\n\n---\n\n### Error 1: \"struggle with writing because they don't understand the basic rules of grammar and punctuation\"\n<details>\n<summary>Identify the error</summary>\nThis sentence is missing a period at the end.\n</details>\n\n<details>\n<summary>Grammar rule</summary>\nEvery complete sentence must end with appropriate punctuation (period, question mark, or exclamation point).\n</details>\n\n<details>\n<summary>Correction</summary>\n\"struggle with writing because they don't understand the basic rules of grammar and punctuation.\"\n</details>\n\n### Error 2: \"its important to proofread your work carefully\"\n<details>\n<summary>Identify the error</summary>\n\"Its\" should be \"it's\" (contraction of \"it is\").\n</details>\n\n<details>\n<summary>Grammar rule</summary>\nUse \"it's\" (with an apostrophe) as a contraction for \"it is\" or \"it has.\" Use \"its\" (without an apostrophe) to show possession.\n</details>\n\n<details>\n<summary>Correction</summary>\n\"it's important to proofread your work carefully\"\n</details>\n\n### Error 3: \"good writing take time and practice\"\n<details>\n<summary>Identify the error</summary>\nSubject-verb agreement error: \"writing\" (singular) doesn't match with \"take\" (plural verb form).\n</details>\n\n<details>\n<summary>Grammar rule</summary>\nA singular subject requires a singular verb form.\n</details>\n\n<details>\n<summary>Correction</summary>\n\"good writing takes time and practice\"\n</details>\n\n### Error 4: \"you should read you're work out loud\"\n<details>\n<summary>Identify the error</summary>\nIncorrect use of \"you're\" instead of the possessive \"your.\"\n</details>\n\n<details>\n<summary>Grammar rule</summary>\n\"You're\" is a contraction of \"you are,\" while \"your\" shows possession.\n</details>\n\n<details>\n<summary>Correction</summary>\n\"you should read your work out loud\"\n</details>\n\n### Error 5: \"writers catch errors they might otherwise miss when reading silently.\"\n<details>\n<summary>Identify the error</summary>\nThis sentence is actually correct! Good job if you noticed there's no error here.\n</details>\n\n## Try It Yourself\n\nNow, try to find and correct the errors in this sentence:\n\n**The students in my class** [turned in they're assignments but the teacher haven't graded them yet]{.practice1}\n\n<details>\n<summary>Solution</summary>\nCorrected sentence: \"The students in my class turned in their assignments, but the teacher hasn't graded them yet.\"\n\nErrors fixed:\n1. \"they're\" → \"their\" (possessive form needed)\n2. Missing comma before the coordinating conjunction \"but\"\n3. \"haven't\" → \"hasn't\" (subject-verb agreement with singular \"teacher\")\n</details>\n\n## Reflection Questions\n\n1. Which error do you find yourself making most frequently in your own writing?\n2. How might reading your work aloud help you catch errors?\n3. Why is it important to understand grammar rules rather than just memorizing corrections?\n4. What strategy will you use to proofread your next writing assignment?\n\n## Key Takeaways\n- Proofreading is an essential step in the writing process\n- Common errors include punctuation mistakes, incorrect word usage, and subject-verb agreement issues\n- Reading your work aloud can help you catch errors you might miss when reading silently\n- Understanding grammar rules helps you become a more confident writer\n\n## Conclusion\n\nIdentifying and correcting errors is an essential skill for all writers. By practicing this skill regularly, you'll become more confident in your writing and produce clearer, more effective communication.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson17_Step1_Error Hunt__We do_.md"
}