{
  "module": "6",
  "lesson": "9",
  "step_number": "1",
  "step_title": "Structured Essay Draft",
  "final_content": "# Structured Essay Draft\n\n## Introduction to Structured Essay Drafting\n\nCreating a well-structured essay begins with organizing your thoughts in a logical manner. A structured draft serves as the foundation for your final essay, allowing you to develop your ideas methodically while ensuring your argument flows coherently. This lesson will guide you through the process of expanding an outline into a 500-word draft with proper headings and organization.\n\n## Why Structure Matters\n\nTaking time to structure your essay before writing saves you time in the long run and helps you create a more compelling argument. A well-structured essay:\n- Makes your ideas easier for readers to follow\n- Helps you identify gaps in your reasoning\n- Provides a framework to organize your evidence\n- Makes the revision process more manageable\n\n## Using the Outline Template\n\nBefore drafting your essay, start with a basic outline template:\n\n1. **Introduction**\n   - Hook/attention grabber\n   - Background information\n   - Thesis statement\n\n2. **Body Paragraph 1**\n   - Topic sentence\n   - Supporting evidence/examples\n   - Analysis\n   - Transition to next paragraph\n\n3. **Body Paragraph 2**\n   - Topic sentence\n   - Supporting evidence/examples\n   - Analysis\n   - Transition to next paragraph\n\n4. **Body Paragraph 3** (if needed)\n   - Topic sentence\n   - Supporting evidence/examples\n   - Analysis\n   - Transition to conclusion\n\n5. **Conclusion**\n   - Restate thesis (in different words)\n   - Summarize main points\n   - Closing thought/call to action\n\n💡 **Pro Tip**: Keep your outline visible while drafting so you can refer back to it and stay on track.\n\n## Expanding Your Outline to 500 Words\n\nWhen expanding your outline to a 500-word draft, allocate your word count strategically:\n- Introduction: 75-100 words\n- Body paragraphs: 100-125 words each (300-375 total)\n- Conclusion: 75-100 words\n\nFor each section, develop your ideas by adding specific details, examples, and explanations that support your thesis. Remember that this is a draft, so focus on getting your ideas down rather than perfecting your language.\n\n### Example: Expanding a Topic Sentence\n**Outline**: Topic sentence - Social media affects teen mental health\n**Draft expansion**: \"Research increasingly shows that excessive social media use correlates with higher rates of anxiety and depression among teenagers. A 2022 study from Stanford University found that teens who spend more than three hours daily on social platforms reported 70% higher rates of depressive symptoms compared to peers with limited usage.\"\n\n## Applying Headings and Subheadings\n\nIncorporate headings and subheadings to organize your draft:\n\n1. Use a descriptive title that captures your essay's main idea\n2. Include section headings for major parts (Introduction, Body, Conclusion)\n3. Consider subheadings for complex body sections to further organize ideas\n4. Format headings consistently (size, style, capitalization)\n\nHeadings improve readability and help both you and your reader follow the logical progression of your argument.\n\n## Creating a Bullet Summary\n\nAfter completing your draft, create a bullet summary that captures the key points:\n\n- List 3-5 main arguments or ideas from your essay\n- Keep each bullet point concise (1-2 sentences)\n- Ensure the summary reflects your thesis and major supporting points\n- Use parallel structure for consistency\n\nThis summary serves as a quick reference for your essay's core content and helps ensure your draft addresses your intended purpose.\n\n## Common Drafting Challenges and Solutions\n\n| Challenge | Solution |\n|-----------|----------|\n| Writer's block | Start with the easiest section first; you don't have to write in order |\n| Underdeveloped ideas | Ask yourself \"why?\" and \"how?\" to dig deeper into your claims |\n| Weak transitions | Use connecting phrases that show relationships (similarly, in contrast, as a result) |\n| Wandering off-topic | Check each paragraph against your thesis to ensure relevance |\n\n## Submitting Your Work\n\nWhen submitting your structured essay draft, include:\n\n1. Your original outline\n2. Your 500-word draft with proper headings\n3. Your bullet summary\n4. Any questions or areas where you need feedback\n\nRemember that this draft is a stepping stone toward your final essay. The structured approach allows for easier revision and refinement in later stages of the writing process.\n\n## Summary\n\n- Begin with a comprehensive outline using the template provided\n- Expand your outline to approximately 500 words, developing each section\n- Apply clear, consistent headings to organize your content\n- Create a concise bullet summary of your main points\n- Submit both your outline and draft for feedback\n\n**Next Steps**: After receiving feedback on your structured draft, you'll learn how to revise and refine your essay for final submission.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson9_Step1_Structured Essay Draft.md"
}