{
  "module": "6",
  "lesson": "38",
  "step_number": "1",
  "step_title": "Portfolio Checklist Quiz—“You do”",
  "final_content": "# Portfolio Checklist Quiz\n\n## Instructions\nMatch each portfolio section with its required evidence item. This activity helps you understand what must be included in your writing portfolio to demonstrate mastery.\n\n## Learning Objective\nBy completing this activity, you will be able to identify all required components of your writing portfolio and understand how each section demonstrates different writing skills.\n\n## Matching Exercise\nMatch the portfolio section (1-8) with its corresponding required evidence (A-H):\n\n1. Personal Narrative Section\n2. Argumentative Writing Section\n3. Research Writing Section\n4. Creative Writing Section\n5. Professional Writing Section\n6. Reflection Section\n7. Revision Process Section\n8. Academic Writing Section\n\n**Required Evidence:**\nA. A formal essay with cited sources and bibliography\nB. A personal statement reflecting on your growth as a writer\nC. A story, poem, or creative piece showing imaginative expression\nD. A persuasive essay with clear claims and supporting evidence\nE. Before and after drafts with editing marks and comments\nF. A research paper with proper citations and methodology\nG. A resume, cover letter, or professional correspondence\nH. A first-person account of a significant personal experience\n\n## Success Criteria\n- Your portfolio must include ALL eight sections to be complete\n- Each section must contain the appropriate evidence that meets quality standards\n- Missing or incomplete sections will require revision before final assessment\n- You can use this checklist throughout your writing process to track your progress\n\n## Need Help?\nIf you're unsure about any portfolio requirements, reach out to your Success Coach or visit the Writing Lab for guidance.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/6 Writing Skills\\6\\Lesson38_Step1_Portfolio Checklist Quiz__You do_.md"
}