{
  "module": "5",
  "lesson": "1",
  "step_number": "1",
  "step_title": "Food as Fuel",
  "final_content": "# Lesson Title: Powering Your Body for Physical Activity\n\nBegin by asking students what they ate for breakfast or before coming to school. Have them share typical pre-PE or sports practice snacks. Show a brief 1-2 minute video clip of athletes discussing their pre-game nutrition. Then explain that today's lesson will explore how different foods provide energy and building blocks for movement, play, and strength development.\n\n## The Three Main Nutrients (15-20 minutes)\n1. Carbohydrates: Your Body's Quick Energy\n   - Carbs are your body's preferred fuel - similar to petrol in a car\n   - Found in foods like bread, pasta, rice, fruits, and vegetables\n   - Your body breaks them down into glucose (sugar) that powers your muscles\n   - Without enough carbs, you might feel tired or weak during activities\n   - Demonstration: Have students do 10 jumping jacks, then explain how carbs powered that movement\n\n2. Proteins: The Muscle Builders\n   - Proteins are like building blocks that help repair and grow your muscles\n   - Found in foods like chicken, eggs, beans, yogurt, and nuts\n   - When you exercise, tiny tears form in your muscles - protein helps fix them\n   - This repair process is what makes your muscles stronger over time\n   - Visual aid: Show before/after pictures of a growing plant to represent muscle growth\n\n3. Fats: Your Long-Lasting Energy Source\n   - Healthy fats are like slow-burning candles that provide energy for longer activities\n   - Found in avocados, nuts, olive oil, and fish\n   - Fats also protect your organs and help your body absorb certain vitamins\n   - Your brain needs fats to work properly too!\n   - Note: While fats are important, we need smaller amounts compared to carbs and protein\n\n## Activity: Nutrient Detectives (10-15 minutes)\n- Divide class into small groups of 3-4 students\n- Give each group a set of food cards with pictures and names of common foods\n- Challenge: Sort the cards into three piles - \"Mainly Carbs,\" \"Mainly Protein,\" and \"Mainly Fats\"\n- For mixed foods (like pizza), discuss which nutrients they contain\n- Come back together and review answers as a class\n- Fun fact: Many foods contain more than one nutrient!\n\n## Fuelling Up for Activity (15-20 minutes)\n- Timing matters! When to eat for best performance:\n  * 2-3 hours before: Larger meals with all three nutrients\n  * 30-60 minutes before: Small carb snack for quick energy\n  * After activity: Protein and carbs to help muscles recover\n- Create a \"Perfect Plate\" model showing:\n  * 1/2 plate: Fruits and vegetables (carbs, vitamins, minerals)\n  * 1/4 plate: Grains or starchy vegetables (carbs)\n  * 1/4 plate: Protein foods\n  * Small amount: Healthy fats\n- Examples of balanced meals and snacks you can easily make:\n  * Peanut butter and banana sandwich on whole grain bread\n  * Yoghurt parfait with fruit and granola\n  * Hummus with veggie sticks and pita bread\n  * Chocolate milk after a workout (natural protein and carbs!)\n\n## Over to You (5-10 minutes)\n- Quick review game: \"Nutrient or Not?\" - call out a nutrient function and give thumbs up if true\n- Exit ticket activity: Create a \"My Performance Plate\" drawing showing what you would eat:\n  * Before your favourite physical activity\n  * After your favourite physical activity\n- Homework challenge: Try one new performance-boosting food this week and report back\n- Final message: \"The food you eat is the fuel for everything you do. Choose your fuel wisely to perform your best!\"",
  "editing_explanation": "I've made several changes to make this lesson plan more human-like and appropriate for middle school students:\n\n1. Removed the formal \"Introduction\" heading and created a more engaging opening\n2. Changed American spelling to British (e.g., \"favorite\" → \"favourite\")\n3. Replaced all instances of \"essential\" with more natural alternatives\n4. Added \"Over to You\" for the reflection section\n5. Made the language more conversational and less formulaic\n6. Varied sentence structures to sound more natural\n7. Reduced the overly enthusiastic tone that's common in AI writing\n8. Added more practical examples relevant to 11-14 year olds\n9. Made transitions between sections more natural\n10. Simplified some concepts without being condescending",
  "ai_patterns_detected": 3,
  "output_path": "C:\\Users\\User\\Desktop\\ShowupSquaredV4 (2)\\ShowupSquaredV4\\ShowupSquaredV4\\library\\Physical Education\\Course Material\\5\\1_Food as Fuel.md"
}