{
  "module": "9",
  "lesson": "2",
  "step_number": "2",
  "step_title": "App Setup Walkthrough",
  "final_content": "# App Setup Walkthrough: Todoist for Time Management\n\n## Introduction\nWelcome to our app setup walkthrough! Today, we'll learn how to set up Todoist, a powerful time management app that can help you organize tasks, set goals, and stay on track with your assignments and projects. By the end of this walkthrough, you'll have a fully configured Todoist account that syncs with Google Calendar and supports your success at Excel High School.\n\n## Learning Objectives\nBy the end of this walkthrough, you will be able to:\n- Create and configure a Todoist account\n- Organize school assignments using projects, tasks, and subtasks\n- Use labels and filters to prioritize your work\n- Sync your Todoist tasks with Google Calendar\n- Apply time management strategies to your Excel High School coursework\n\n## Setting Up Todoist\n\n### Step 1: Creating a Todoist Account\n![Todoist Sign-up Screen](https://example.com/todoist-signup.jpg)\n1. Visit todoist.com or download the Todoist app from your device's app store\n2. Click \"Sign up\" and create an account using your email or Google account\n3. Follow the prompts to complete your profile setup\n4. **Tip for Excel Students**: Use the same email address you use for your Excel High School account to keep your academic tools connected\n\n### Step 2: Creating Your First Project\n![Creating a Project in Todoist](https://example.com/todoist-project.jpg)\n1. In the left sidebar, click the \"+\" button next to \"Projects\"\n2. Name your project (e.g., \"Excel High School Courses\")\n3. Choose a color for your project (optional)\n4. Click \"Add\" to create the project\n\n### Step 3: Adding Tasks to Your Project\n![Adding Tasks to Todoist](https://example.com/todoist-tasks.jpg)\n1. Select your project from the sidebar\n2. Click the \"+\" button to add a task\n3. Type your task name (e.g., \"Complete Algebra Unit 3 Quiz\")\n4. Set a due date by clicking the calendar icon\n5. Add any additional details in the task description\n6. **Pro Tip**: For Excel High School assignments, include the course name and module number in your task title for easy reference\n\n### Step 4: Using Labels for Organization\n![Adding Labels in Todoist](https://example.com/todoist-labels.jpg)\n1. Go to Settings → Labels\n2. Click \"Add Label\"\n3. Create labels such as \"High Priority,\" \"Medium Priority,\" \"Low Priority\"\n4. Consider creating subject-specific labels like \"Math,\" \"Science,\" or \"English\"\n5. Apply these labels to tasks by selecting a task and clicking the label icon\n\n### Step 5: Creating Filters for Your Excel Coursework\n![Creating Filters in Todoist](https://example.com/todoist-filters.jpg)\n1. Go to Settings → Filters\n2. Click \"Add Filter\"\n3. Name your filter (e.g., \"This Week's Excel Assignments\")\n4. Enter a filter query (e.g., \"7 days & @ExcelHS\")\n5. Create another filter for \"Due Today\" to stay on track with your daily goals\n6. Save your filters\n\n### Step 6: Setting Academic Goals with Todoist\n![Setting Goals in Todoist](https://example.com/todoist-goals.jpg)\n1. Create a new project called \"Excel High School Goals\"\n2. Add your academic goals as tasks (e.g., \"Complete Algebra course by June 15\")\n3. Break down larger goals into smaller subtasks (e.g., \"Finish Algebra Module 1 by Friday\")\n4. Set realistic deadlines that align with Excel High School's suggested pacing\n5. Review your goals weekly and adjust as needed\n\n### Step 7: Syncing with Google Calendar\n![Syncing with Google Calendar](https://example.com/todoist-gcal.jpg)\n1. Go to Settings → Integrations\n2. Find Google Calendar and click \"Connect\"\n3. Sign in to your Google account when prompted\n4. Choose which projects to sync with your calendar\n5. Confirm the connection\n6. **Benefit**: Now you can see all your Excel High School deadlines alongside other commitments\n\n## Practice Exercise: Set Up Your Excel High School Task System\n\nNow it's your turn to practice setting up Todoist for effective time management with your Excel High School courses:\n\n1. Create a new project called \"Excel High School Courses\"\n2. Add each of your current courses as separate tasks\n3. For each course, create subtasks for upcoming assignments and assessments\n4. Apply priority labels based on due dates and difficulty level\n5. Create a filter that shows all high-priority tasks due this week\n6. Sync your tasks with Google Calendar\n7. Take a screenshot of your completed setup to share with your Success Coach\n\n## Time Management Tips for Excel High School Students\n\n* **Daily Check-ins**: Spend 5 minutes each morning reviewing your Todoist tasks for the day\n* **Weekly Planning**: Set aside 15-30 minutes each Sunday to plan your Excel High School coursework for the week\n* **Break It Down**: Divide larger assignments into smaller, manageable tasks\n* **Use Reminders**: Set reminders for important deadlines and study sessions\n* **Track Progress**: Mark tasks as complete to maintain motivation and see your progress\n\n## Conclusion\n\nCongratulations! You've successfully set up Todoist as your time management tool for Excel High School. Remember to check your app daily, update tasks as you complete them, and regularly review your academic goals and priorities. Effective time management is a critical skill for success in online learning environments like Excel High School.\n\n**Next Steps**: Share your Todoist setup with your Success Coach for feedback, and consider exploring the BRYTE AI Tutor for additional support with your coursework.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED/9 Time Management\\9\\Lesson2_Step2_App Setup Walkthrough.md"
}