{
  "module": "1",
  "lesson": "9",
  "step_number": "41",
  "step_title": "Portfolio Guidelines",
  "final_content": "# Portfolio Guidelines: Perseverance & Grit\n\n## Purpose of Your Portfolio\n\nThe Perseverance & Grit Portfolio showcases your journey in developing resilience and determination throughout this course. This portfolio will:\n\n1. Document your personal growth in applying perseverance strategies\n2. Provide evidence of your understanding of grit concepts\n3. Showcase your ability to reflect on challenges and overcome obstacles\n4. Demonstrate how you've implemented perseverance techniques in your academic and personal life\n\nYour portfolio serves two purposes: it counts toward your academic credit AND becomes a personal resource you can use when facing future challenges.\n\n## Required Artifacts\n\nYour portfolio must include these six items:\n\n1. **Personal Reflection Essay** (1-2 pages)\n   * Discuss your understanding of perseverance and grit\n   * Explain how your perspective has evolved during this course\n   * Include specific examples of how your thinking has changed\n   \n2. **Challenge Log**\n   * Document at least 5 challenges you faced\n   * For each challenge, describe:\n     - The specific situation\n     - How you felt\n     - Which perseverance strategy you applied\n     - The outcome\n     - What you learned\n\n3. **Strategy Implementation Evidence**\n   * Show how you've applied at least 3 different perseverance techniques\n   * Acceptable formats: photos with captions, journal entries, screenshots, audio reflections, or other creative documentation\n   * Each piece of evidence should include a brief explanation (2-3 sentences)\n\n4. **Research Summary** (1 page)\n   * Choose one aspect of perseverance or grit that interests you\n   * Summarize key findings from at least 2 credible sources\n   * Explain how this research applies to your life\n\n5. **Goal Setting Document**\n   * Create 3 SMART goals (Specific, Measurable, Achievable, Relevant, Time-bound)\n   * For each goal, outline:\n     - Potential obstacles you might face\n     - Specific strategies you'll use to persevere\n     - How you'll track progress\n\n6. **Inspirational Figure Analysis** (1 page)\n   * Select someone who demonstrates perseverance and grit\n   * Analyze their specific actions and mindset\n   * Connect their example to concepts from the course\n   * Explain what you can apply to your own life\n\n## File Naming Rules\n\nName your files using this format to ensure proper organization:\n\nLastName_FirstInitial_ArtifactName_Date\nExample: `Smith_J_Reflection_10-15-2023.pdf`\n\nAdditional requirements:\n* Use underscores instead of spaces\n* Include the appropriate file extension (.pdf, .docx, .jpg, etc.)\n* Keep filenames under 30 characters (excluding extension)\n* Use only letters, numbers, and underscores (no special characters)\n\n## Academic Honesty Note\n\nAll work in your portfolio must be your original creation. When referencing outside sources:\n* Cite properly using MLA or APA format\n* Include a Works Cited or References page when needed\n\nThe true value of this portfolio comes from your authentic reflection and personal growth. Submitting work created by others defeats the purpose and will require revision before assessment.\n\n## Submission Process\n\n### Step 1: Prepare Your Files\n* Review all artifacts to ensure they meet requirements\n* Check that all files follow the naming convention\n* Create a single ZIP file containing all portfolio artifacts\n* Name the ZIP file: LastName_FirstInitial_Portfolio.zip (Example: `Smith_J_Portfolio.zip`)\n\n### Step 2: Submit Through Excel High School Portal\n1. Log in to your Excel High School student portal\n2. Navigate to \"Courses\" → \"Perseverance & Grit\" → \"Assignments\"\n3. Find \"Final Portfolio Submission\" and click \"Submit Assignment\"\n4. Click \"Choose File\" and select your ZIP file\n5. Add any optional comments for your instructor\n6. Click \"Submit\" and confirm you receive a submission confirmation\n\n### Need Help?\nIf you encounter technical difficulties, contact support@excelhighschool.com or use the chat feature in your student portal.\n\n**Submission Deadline:** [Insert specific deadline here]",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED\\1\\Lesson9_Step41_Portfolio Guidelines.md"
}