{
  "module": "1",
  "lesson": "1",
  "step_number": "4",
  "step_title": "Personal Definition Infographic",
  "final_content": "# Personal Definition Infographic\n\n## Task Brief\n\nIn this assignment, you will create a visual infographic that defines and distinguishes between perseverance and grit while sharing your personal strategies for developing these qualities.\n\n### Learning Objectives:\n* Demonstrate understanding of the concepts of perseverance and grit\n* Apply visual design principles to communicate complex ideas\n* Reflect on personal strategies for developing resilience skills\n\n### Instructions:\n\n1. **Choose a Digital Design Tool**\n   * Visit [Canva.com](https://www.canva.com/) (free account available) or use another design tool you're comfortable with\n   * Select an infographic template that allows for clear organization of information\n   * If you need accessibility accommodations, please contact your Success Coach\n\n2. **Required Elements:**\n   * **Definition Sections:** Create clear, distinct areas defining both perseverance and grit\n   * **Visual Elements:** Select appropriate symbols or images that represent each concept\n   * **Color Coding:** Use colors thoughtfully to distinguish between the two concepts\n   * **Personal Strategies:** Include at least two specific strategies you use to develop:\n     - Perseverance (overcoming short-term obstacles)\n     - Grit (maintaining long-term commitment to goals despite challenges)\n   * **Examples:** Provide a brief real-life example for each concept\n\n3. **Submission Guidelines:**\n   * Download your completed infographic as a PDF or PNG file\n   * Upload to the assignment submission area\n   * Include a brief reflection (100-150 words) explaining:\n     - How your visual choices support your definitions\n     - Why you selected your particular strategies\n\n4. **Accessibility Requirements:**\n   * Include alt-text descriptions when you submit your infographic\n   * Ensure text has sufficient contrast with background colors\n   * Use readable font sizes (minimum 12pt)\n\n5. **Resources:**\n   * [Video: Understanding Grit vs. Perseverance](https://www.example.com) (3 minutes)\n   * [Article: Developing Resilience Skills](https://www.example.com)\n   * [Tutorial: Creating Accessible Infographics](https://www.example.com)\n\nThis assignment helps you clarify your understanding of these important concepts while creating a visual reference that can motivate you throughout your academic journey at Excel High School.\n\n**Time Estimate:** 45-60 minutes\n**Points:** 25\n**Due:** End of Week 3",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED\\1\\Lesson1_Step4_Personal Definition Infographic.md"
}