{
  "module": "1",
  "lesson": "9",
  "step_number": "45",
  "step_title": "Portfolio Rubric",
  "final_content": "# Portfolio Rubric\n\n## Assessment Criteria\n\nYour Perseverance & Grit Portfolio will be evaluated based on three key criteria:\n\n1. **Completeness** (40%)\n   - All required elements are included\n   - Strategies are thoroughly documented\n   - Examples demonstrate application of concepts\n\n2. **Reflection Depth** (40%)\n   - Thoughtful analysis of challenges faced\n   - Clear connections between strategies and outcomes\n   - Personal growth insights clearly articulated\n\n3. **Organization** (20%)\n   - Logical structure and flow\n   - Professional presentation\n   - Easy navigation between sections\n\n## Scoring Guide\n\n| Score Level | Completeness (40%) | Reflection Depth (40%) | Organization (20%) |\n|-------------|--------------|------------------|--------------|\n| **Excellent** (90-100%) | All elements present with detailed, specific examples that show mastery of perseverance strategies | Deep, insightful reflections with clear evidence of personal growth and application of strategies in multiple contexts | Exceptionally organized with cohesive structure; professional presentation with thoughtful transitions between sections |\n| **Proficient** (80-89%) | Most elements present with good examples that demonstrate understanding of perseverance concepts | Thoughtful reflections showing personal insight and connections between strategies and outcomes | Well-organized with clear sections and consistent formatting |\n| **Developing** (70-79%) | Basic elements present with limited examples; some key strategies may lack detail | Surface-level reflections with minimal analysis of how strategies affected outcomes | Basic organization with some structure; navigation between sections may require improvement |\n| **Beginning** (Below 70%) | Missing multiple elements; examples are vague or disconnected from perseverance concepts | Minimal or no reflection on personal growth; limited connection to course concepts | Disorganized or difficult to follow; lacks clear structure |\n\n## Submission and Feedback\n\nYou will receive detailed feedback on your portfolio submission within 3 business days. Your Success Coach is available to answer questions about this assignment through the messaging system.\n\n**Pro Tip:** Use the scoring guide as a checklist while creating your portfolio to ensure you're meeting expectations for each criterion.",
  "editing_explanation": "No AI patterns detected, no edits needed.",
  "ai_patterns_detected": 0,
  "output_path": "C:/Users/User/Documents/showup-v4/showup-library/library/ElevaTtED\\1\\Lesson9_Step45_Portfolio Rubric.md"
}